MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
// Register: AD1CON3
#define AD1CON3 AD1CON3
extern volatile unsigned char           AD1CON3             __at(0x714);
#ifndef _LIB_BUILD
asm("AD1CON3 equ 0714h");
#endif
// aliases
extern volatile unsigned char           AADCON3             __at(0x714);
#ifndef _LIB_BUILD
asm("AADCON3 equ 0714h");
#endif
extern volatile unsigned char           AAD1CON3            __at(0x714);
#ifndef _LIB_BUILD
asm("AAD1CON3 equ 0714h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD1DSEN                :1;
        unsigned AD1IPEN                :1;
        unsigned                        :4;
        unsigned AD1IPPOL               :1;
        unsigned AD1EPPOL               :1;
    };
    struct {
        unsigned ADDSEN                 :1;
        unsigned ADIPEN                 :1;
        unsigned                        :4;
        unsigned ADIPPOL                :1;
        unsigned ADEPPOL                :1;
    };
} AD1CON3bits_t;
extern volatile AD1CON3bits_t AD1CON3bits __at(0x714);
// bitfield macros
#define _AD1CON3_AD1DSEN_POSN                               0x0
#define _AD1CON3_AD1DSEN_POSITION                           0x0
#define _AD1CON3_AD1DSEN_SIZE                               0x1
#define _AD1CON3_AD1DSEN_LENGTH                             0x1
#define _AD1CON3_AD1DSEN_MASK                               0x1
#define _AD1CON3_AD1IPEN_POSN                               0x1
#define _AD1CON3_AD1IPEN_POSITION                           0x1
#define _AD1CON3_AD1IPEN_SIZE                               0x1
#define _AD1CON3_AD1IPEN_LENGTH                             0x1
#define _AD1CON3_AD1IPEN_MASK                               0x2
#define _AD1CON3_AD1IPPOL_POSN                              0x6
#define _AD1CON3_AD1IPPOL_POSITION                          0x6
#define _AD1CON3_AD1IPPOL_SIZE                              0x1
#define _AD1CON3_AD1IPPOL_LENGTH                            0x1
#define _AD1CON3_AD1IPPOL_MASK                              0x40
#define _AD1CON3_AD1EPPOL_POSN                              0x7
#define _AD1CON3_AD1EPPOL_POSITION                          0x7
#define _AD1CON3_AD1EPPOL_SIZE                              0x1
#define _AD1CON3_AD1EPPOL_LENGTH                            0x1
#define _AD1CON3_AD1EPPOL_MASK                              0x80
#define _AD1CON3_ADDSEN_POSN                                0x0
#define _AD1CON3_ADDSEN_POSITION                            0x0
#define _AD1CON3_ADDSEN_SIZE                                0x1
#define _AD1CON3_ADDSEN_LENGTH                              0x1
#define _AD1CON3_ADDSEN_MASK                                0x1
#define _AD1CON3_ADIPEN_POSN                                0x1
#define _AD1CON3_ADIPEN_POSITION                            0x1
#define _AD1CON3_ADIPEN_SIZE                                0x1
#define _AD1CON3_ADIPEN_LENGTH                              0x1
#define _AD1CON3_ADIPEN_MASK                                0x2
#define _AD1CON3_ADIPPOL_POSN                               0x6
#define _AD1CON3_ADIPPOL_POSITION                           0x6
#define _AD1CON3_ADIPPOL_SIZE                               0x1
#define _AD1CON3_ADIPPOL_LENGTH                             0x1
#define _AD1CON3_ADIPPOL_MASK                               0x40
#define _AD1CON3_ADEPPOL_POSN                               0x7
#define _AD1CON3_ADEPPOL_POSITION                           0x7
#define _AD1CON3_ADEPPOL_SIZE                               0x1
#define _AD1CON3_ADEPPOL_LENGTH                             0x1
#define _AD1CON3_ADEPPOL_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned AD1DSEN                :1;
        unsigned AD1IPEN                :1;
        unsigned                        :4;
        unsigned AD1IPPOL               :1;
        unsigned AD1EPPOL               :1;
    };
    struct {
        unsigned ADDSEN                 :1;
        unsigned ADIPEN                 :1;
        unsigned                        :4;
        unsigned ADIPPOL                :1;
        unsigned ADEPPOL                :1;
    };
} AADCON3bits_t;
extern volatile AADCON3bits_t AADCON3bits __at(0x714);
// bitfield macros
#define _AADCON3_AD1DSEN_POSN                               0x0
#define _AADCON3_AD1DSEN_POSITION                           0x0
#define _AADCON3_AD1DSEN_SIZE                               0x1
#define _AADCON3_AD1DSEN_LENGTH                             0x1
#define _AADCON3_AD1DSEN_MASK                               0x1
#define _AADCON3_AD1IPEN_POSN                               0x1
#define _AADCON3_AD1IPEN_POSITION                           0x1
#define _AADCON3_AD1IPEN_SIZE                               0x1
#define _AADCON3_AD1IPEN_LENGTH                             0x1
#define _AADCON3_AD1IPEN_MASK                               0x2
#define _AADCON3_AD1IPPOL_POSN                              0x6
#define _AADCON3_AD1IPPOL_POSITION                          0x6
#define _AADCON3_AD1IPPOL_SIZE                              0x1
#define _AADCON3_AD1IPPOL_LENGTH                            0x1
#define _AADCON3_AD1IPPOL_MASK                              0x40
#define _AADCON3_AD1EPPOL_POSN                              0x7
#define _AADCON3_AD1EPPOL_POSITION                          0x7
#define _AADCON3_AD1EPPOL_SIZE                              0x1
#define _AADCON3_AD1EPPOL_LENGTH                            0x1
#define _AADCON3_AD1EPPOL_MASK                              0x80
#define _AADCON3_ADDSEN_POSN                                0x0
#define _AADCON3_ADDSEN_POSITION                            0x0
#define _AADCON3_ADDSEN_SIZE                                0x1
#define _AADCON3_ADDSEN_LENGTH                              0x1
#define _AADCON3_ADDSEN_MASK                                0x1
#define _AADCON3_ADIPEN_POSN                                0x1
#define _AADCON3_ADIPEN_POSITION                            0x1
#define _AADCON3_ADIPEN_SIZE                                0x1
#define _AADCON3_ADIPEN_LENGTH                              0x1
#define _AADCON3_ADIPEN_MASK                                0x2
#define _AADCON3_ADIPPOL_POSN                               0x6
#define _AADCON3_ADIPPOL_POSITION                           0x6
#define _AADCON3_ADIPPOL_SIZE                               0x1
#define _AADCON3_ADIPPOL_LENGTH                             0x1
#define _AADCON3_ADIPPOL_MASK                               0x40
#define _AADCON3_ADEPPOL_POSN                               0x7
#define _AADCON3_ADEPPOL_POSITION                           0x7
#define _AADCON3_ADEPPOL_SIZE                               0x1
#define _AADCON3_ADEPPOL_LENGTH                             0x1
#define _AADCON3_ADEPPOL_MASK                               0x80
typedef union {
    struct {
        unsigned AD1DSEN                :1;
        unsigned AD1IPEN                :1;
        unsigned                        :4;
        unsigned AD1IPPOL               :1;
        unsigned AD1EPPOL               :1;
    };
    struct {
        unsigned ADDSEN                 :1;
        unsigned ADIPEN                 :1;
        unsigned                        :4;
        unsigned ADIPPOL                :1;
        unsigned ADEPPOL                :1;
    };
} AAD1CON3bits_t;
extern volatile AAD1CON3bits_t AAD1CON3bits __at(0x714);
// bitfield macros
#define _AAD1CON3_AD1DSEN_POSN                              0x0
#define _AAD1CON3_AD1DSEN_POSITION                          0x0
#define _AAD1CON3_AD1DSEN_SIZE                              0x1
#define _AAD1CON3_AD1DSEN_LENGTH                            0x1
#define _AAD1CON3_AD1DSEN_MASK                              0x1
#define _AAD1CON3_AD1IPEN_POSN                              0x1
#define _AAD1CON3_AD1IPEN_POSITION                          0x1
#define _AAD1CON3_AD1IPEN_SIZE                              0x1
#define _AAD1CON3_AD1IPEN_LENGTH                            0x1
#define _AAD1CON3_AD1IPEN_MASK                              0x2
#define _AAD1CON3_AD1IPPOL_POSN                             0x6
#define _AAD1CON3_AD1IPPOL_POSITION                         0x6
#define _AAD1CON3_AD1IPPOL_SIZE                             0x1
#define _AAD1CON3_AD1IPPOL_LENGTH                           0x1
#define _AAD1CON3_AD1IPPOL_MASK                             0x40
#define _AAD1CON3_AD1EPPOL_POSN                             0x7
#define _AAD1CON3_AD1EPPOL_POSITION                         0x7
#define _AAD1CON3_AD1EPPOL_SIZE                             0x1
#define _AAD1CON3_AD1EPPOL_LENGTH                           0x1
#define _AAD1CON3_AD1EPPOL_MASK                             0x80
#define _AAD1CON3_ADDSEN_POSN                               0x0
#define _AAD1CON3_ADDSEN_POSITION                           0x0
#define _AAD1CON3_ADDSEN_SIZE                               0x1
#define _AAD1CON3_ADDSEN_LENGTH                             0x1
#define _AAD1CON3_ADDSEN_MASK                               0x1
#define _AAD1CON3_ADIPEN_POSN                               0x1
#define _AAD1CON3_ADIPEN_POSITION                           0x1
#define _AAD1CON3_ADIPEN_SIZE                               0x1
#define _AAD1CON3_ADIPEN_LENGTH                             0x1
#define _AAD1CON3_ADIPEN_MASK                               0x2
#define _AAD1CON3_ADIPPOL_POSN                              0x6
#define _AAD1CON3_ADIPPOL_POSITION                          0x6
#define _AAD1CON3_ADIPPOL_SIZE                              0x1
#define _AAD1CON3_ADIPPOL_LENGTH                            0x1
#define _AAD1CON3_ADIPPOL_MASK                              0x40
#define _AAD1CON3_ADEPPOL_POSN                              0x7
#define _AAD1CON3_ADEPPOL_POSITION                          0x7
#define _AAD1CON3_ADEPPOL_SIZE                              0x1
#define _AAD1CON3_ADEPPOL_LENGTH                            0x1
#define _AAD1CON3_ADEPPOL_MASK                              0x80

// Register: ADSTAT
#define ADSTAT ADSTAT
extern volatile unsigned char           ADSTAT              __at(0x715);
#ifndef _LIB_BUILD
asm("ADSTAT equ 0715h");
#endif
// aliases
extern volatile unsigned char           AADSTAT             __at(0x715);
#ifndef _LIB_BUILD
asm("AADSTAT equ 0715h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD1STG                 :2;
        unsigned AD1CONV                :1;
        unsigned                        :1;
        unsigned AD2STG                 :2;
        unsigned AD2CONV                :1;
    };
    struct {
        unsigned ADSTG                  :2;
        unsigned ADCONV                 :1;
    };
    struct {
        unsigned AD1STG0                :1;
        unsigned AD1STG1                :1;
        unsigned                        :2;
        unsigned AD2STG0                :1;
        unsigned AD2STG1                :1;
    };
} ADSTATbits_t;
