MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
extern volatile AD1RES0Lbits_t AD1RES0Lbits __at(0x71A);
// bitfield macros
#define _AD1RES0L_ADRESL_POSN                               0x0
#define _AD1RES0L_ADRESL_POSITION                           0x0
#define _AD1RES0L_ADRESL_SIZE                               0x8
#define _AD1RES0L_ADRESL_LENGTH                             0x8
#define _AD1RES0L_ADRESL_MASK                               0xFF

// Register: AAD1RES0H
#define AAD1RES0H AAD1RES0H
extern volatile unsigned char           AAD1RES0H           __at(0x71B);
#ifndef _LIB_BUILD
asm("AAD1RES0H equ 071Bh");
#endif
// aliases
extern volatile unsigned char           AD1RES0H            __at(0x71B);
#ifndef _LIB_BUILD
asm("AD1RES0H equ 071Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AAD1RES0Hbits_t;
extern volatile AAD1RES0Hbits_t AAD1RES0Hbits __at(0x71B);
// bitfield macros
#define _AAD1RES0H_ADRESH_POSN                              0x0
#define _AAD1RES0H_ADRESH_POSITION                          0x0
#define _AAD1RES0H_ADRESH_SIZE                              0x8
#define _AAD1RES0H_ADRESH_LENGTH                            0x8
#define _AAD1RES0H_ADRESH_MASK                              0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AD1RES0Hbits_t;
extern volatile AD1RES0Hbits_t AD1RES0Hbits __at(0x71B);
// bitfield macros
#define _AD1RES0H_ADRESH_POSN                               0x0
#define _AD1RES0H_ADRESH_POSITION                           0x0
#define _AD1RES0H_ADRESH_SIZE                               0x8
#define _AD1RES0H_ADRESH_LENGTH                             0x8
#define _AD1RES0H_ADRESH_MASK                               0xFF

// Register: AAD1RES1
#define AAD1RES1 AAD1RES1
extern volatile unsigned short          AAD1RES1            __at(0x71C);
#ifndef _LIB_BUILD
asm("AAD1RES1 equ 071Ch");
#endif
// aliases
extern volatile unsigned short          AD1RES1             __at(0x71C);
#ifndef _LIB_BUILD
asm("AD1RES1 equ 071Ch");
#endif
extern volatile unsigned short          ADRES1              __at(0x71C);
#ifndef _LIB_BUILD
asm("ADRES1 equ 071Ch");
#endif

// Register: AAD1RES1L
#define AAD1RES1L AAD1RES1L
extern volatile unsigned char           AAD1RES1L           __at(0x71C);
#ifndef _LIB_BUILD
asm("AAD1RES1L equ 071Ch");
#endif
// aliases
extern volatile unsigned char           AD1RES1L            __at(0x71C);
#ifndef _LIB_BUILD
asm("AD1RES1L equ 071Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AAD1RES1Lbits_t;
extern volatile AAD1RES1Lbits_t AAD1RES1Lbits __at(0x71C);
// bitfield macros
#define _AAD1RES1L_ADRESL_POSN                              0x0
#define _AAD1RES1L_ADRESL_POSITION                          0x0
#define _AAD1RES1L_ADRESL_SIZE                              0x8
#define _AAD1RES1L_ADRESL_LENGTH                            0x8
#define _AAD1RES1L_ADRESL_MASK                              0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AD1RES1Lbits_t;
extern volatile AD1RES1Lbits_t AD1RES1Lbits __at(0x71C);
// bitfield macros
#define _AD1RES1L_ADRESL_POSN                               0x0
#define _AD1RES1L_ADRESL_POSITION                           0x0
#define _AD1RES1L_ADRESL_SIZE                               0x8
#define _AD1RES1L_ADRESL_LENGTH                             0x8
#define _AD1RES1L_ADRESL_MASK                               0xFF

// Register: AAD1RES1H
#define AAD1RES1H AAD1RES1H
extern volatile unsigned char           AAD1RES1H           __at(0x71D);
#ifndef _LIB_BUILD
asm("AAD1RES1H equ 071Dh");
#endif
// aliases
extern volatile unsigned char           AD1RES1H            __at(0x71D);
#ifndef _LIB_BUILD
asm("AD1RES1H equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AAD1RES1Hbits_t;
extern volatile AAD1RES1Hbits_t AAD1RES1Hbits __at(0x71D);
// bitfield macros
#define _AAD1RES1H_ADRESH_POSN                              0x0
#define _AAD1RES1H_ADRESH_POSITION                          0x0
#define _AAD1RES1H_ADRESH_SIZE                              0x8
#define _AAD1RES1H_ADRESH_LENGTH                            0x8
#define _AAD1RES1H_ADRESH_MASK                              0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AD1RES1Hbits_t;
extern volatile AD1RES1Hbits_t AD1RES1Hbits __at(0x71D);
// bitfield macros
#define _AD1RES1H_ADRESH_POSN                               0x0
#define _AD1RES1H_ADRESH_POSITION                           0x0
#define _AD1RES1H_ADRESH_SIZE                               0x8
#define _AD1RES1H_ADRESH_LENGTH                             0x8
#define _AD1RES1H_ADRESH_MASK                               0xFF

// Register: AD1CH
#define AD1CH AD1CH
extern volatile unsigned short          AD1CH               __at(0x71E);
#ifndef _LIB_BUILD
asm("AD1CH equ 071Eh");
#endif
// aliases
extern volatile unsigned short          AAD1CH              __at(0x71E);
#ifndef _LIB_BUILD
asm("AAD1CH equ 071Eh");
#endif

// Register: AD1CH0
#define AD1CH0 AD1CH0
extern volatile unsigned char           AD1CH0              __at(0x71E);
#ifndef _LIB_BUILD
asm("AD1CH0 equ 071Eh");
#endif
// aliases
extern volatile unsigned char           AAD1CH0             __at(0x71E);
#ifndef _LIB_BUILD
asm("AAD1CH0 equ 071Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH10                   :1;
        unsigned CH11                   :1;
        unsigned CH12                   :1;
        unsigned CH13                   :1;
        unsigned CH14                   :1;
        unsigned CH15                   :1;
        unsigned CH16                   :1;
        unsigned CHS17                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned CH17                   :1;
    };
} AD1CH0bits_t;
extern volatile AD1CH0bits_t AD1CH0bits __at(0x71E);
// bitfield macros
#define _AD1CH0_CH10_POSN                                   0x0
#define _AD1CH0_CH10_POSITION                               0x0
#define _AD1CH0_CH10_SIZE                                   0x1
#define _AD1CH0_CH10_LENGTH                                 0x1
#define _AD1CH0_CH10_MASK                                   0x1
#define _AD1CH0_CH11_POSN                                   0x1
#define _AD1CH0_CH11_POSITION                               0x1
#define _AD1CH0_CH11_SIZE                                   0x1
#define _AD1CH0_CH11_LENGTH                                 0x1
#define _AD1CH0_CH11_MASK                                   0x2
#define _AD1CH0_CH12_POSN                                   0x2
#define _AD1CH0_CH12_POSITION                               0x2
#define _AD1CH0_CH12_SIZE                                   0x1
#define _AD1CH0_CH12_LENGTH                                 0x1
#define _AD1CH0_CH12_MASK                                   0x4
#define _AD1CH0_CH13_POSN                                   0x3
#define _AD1CH0_CH13_POSITION                               0x3
#define _AD1CH0_CH13_SIZE                                   0x1
#define _AD1CH0_CH13_LENGTH                                 0x1
#define _AD1CH0_CH13_MASK                                   0x8
#define _AD1CH0_CH14_POSN                                   0x4
#define _AD1CH0_CH14_POSITION                               0x4
#define _AD1CH0_CH14_SIZE                                   0x1
#define _AD1CH0_CH14_LENGTH                                 0x1
#define _AD1CH0_CH14_MASK                                   0x10
#define _AD1CH0_CH15_POSN                                   0x5
#define _AD1CH0_CH15_POSITION                               0x5
#define _AD1CH0_CH15_SIZE                                   0x1
#define _AD1CH0_CH15_LENGTH                                 0x1
#define _AD1CH0_CH15_MASK                                   0x20
#define _AD1CH0_CH16_POSN                                   0x6
#define _AD1CH0_CH16_POSITION                               0x6
#define _AD1CH0_CH16_SIZE                                   0x1
#define _AD1CH0_CH16_LENGTH                                 0x1
#define _AD1CH0_CH16_MASK                                   0x40
#define _AD1CH0_CHS17_POSN                                  0x7
#define _AD1CH0_CHS17_POSITION                              0x7
#define _AD1CH0_CHS17_SIZE                                  0x1
#define _AD1CH0_CHS17_LENGTH                                0x1
#define _AD1CH0_CHS17_MASK                                  0x80
#define _AD1CH0_CH17_POSN                                   0x7
#define _AD1CH0_CH17_POSITION                               0x7
#define _AD1CH0_CH17_SIZE                                   0x1
#define _AD1CH0_CH17_LENGTH                                 0x1
#define _AD1CH0_CH17_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned CH10                   :1;
        unsigned CH11                   :1;
        unsigned CH12                   :1;
        unsigned CH13                   :1;
        unsigned CH14                   :1;
        unsigned CH15                   :1;
        unsigned CH16                   :1;
        unsigned CHS17                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned CH17                   :1;
    };
} AAD1CH0bits_t;
extern volatile AAD1CH0bits_t AAD1CH0bits __at(0x71E);
// bitfield macros
#define _AAD1CH0_CH10_POSN                                  0x0
#define _AAD1CH0_CH10_POSITION                              0x0
#define _AAD1CH0_CH10_SIZE                                  0x1
#define _AAD1CH0_CH10_LENGTH                                0x1
#define _AAD1CH0_CH10_MASK                                  0x1
#define _AAD1CH0_CH11_POSN                                  0x1
#define _AAD1CH0_CH11_POSITION                              0x1
#define _AAD1CH0_CH11_SIZE                                  0x1
#define _AAD1CH0_CH11_LENGTH                                0x1
#define _AAD1CH0_CH11_MASK                                  0x2
#define _AAD1CH0_CH12_POSN                                  0x2
#define _AAD1CH0_CH12_POSITION                              0x2
#define _AAD1CH0_CH12_SIZE                                  0x1
#define _AAD1CH0_CH12_LENGTH                                0x1
#define _AAD1CH0_CH12_MASK                                  0x4
#define _AAD1CH0_CH13_POSN                                  0x3
#define _AAD1CH0_CH13_POSITION                              0x3
#define _AAD1CH0_CH13_SIZE                                  0x1
#define _AAD1CH0_CH13_LENGTH                                0x1
#define _AAD1CH0_CH13_MASK                                  0x8
#define _AAD1CH0_CH14_POSN                                  0x4
#define _AAD1CH0_CH14_POSITION                              0x4
#define _AAD1CH0_CH14_SIZE                                  0x1
#define _AAD1CH0_CH14_LENGTH                                0x1
#define _AAD1CH0_CH14_MASK                                  0x10
#define _AAD1CH0_CH15_POSN                                  0x5
#define _AAD1CH0_CH15_POSITION                              0x5
#define _AAD1CH0_CH15_SIZE                                  0x1
#define _AAD1CH0_CH15_LENGTH                                0x1
#define _AAD1CH0_CH15_MASK                                  0x20
#define _AAD1CH0_CH16_POSN                                  0x6
#define _AAD1CH0_CH16_POSITION                              0x6
#define _AAD1CH0_CH16_SIZE                                  0x1
#define _AAD1CH0_CH16_LENGTH                                0x1
#define _AAD1CH0_CH16_MASK                                  0x40
#define _AAD1CH0_CHS17_POSN                                 0x7
#define _AAD1CH0_CHS17_POSITION                             0x7
#define _AAD1CH0_CHS17_SIZE                                 0x1
#define _AAD1CH0_CHS17_LENGTH                               0x1
#define _AAD1CH0_CHS17_MASK                                 0x80
#define _AAD1CH0_CH17_POSN                                  0x7
#define _AAD1CH0_CH17_POSITION                              0x7
#define _AAD1CH0_CH17_SIZE                                  0x1
#define _AAD1CH0_CH17_LENGTH                                0x1
#define _AAD1CH0_CH17_MASK                                  0x80

// Register: AD1CH1
#define AD1CH1 AD1CH1
extern volatile unsigned char           AD1CH1              __at(0x71F);
#ifndef _LIB_BUILD
asm("AD1CH1 equ 071Fh");
#endif
// aliases
extern volatile unsigned char           AAD1CH1             __at(0x71F);
#ifndef _LIB_BUILD
asm("AAD1CH1 equ 071Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH18                   :1;
        unsigned CH19                   :1;
    };
} AD1CH1bits_t;
