MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
extern volatile AD1CH1bits_t AD1CH1bits __at(0x71F);
// bitfield macros
#define _AD1CH1_CH18_POSN                                   0x0
#define _AD1CH1_CH18_POSITION                               0x0
#define _AD1CH1_CH18_SIZE                                   0x1
#define _AD1CH1_CH18_LENGTH                                 0x1
#define _AD1CH1_CH18_MASK                                   0x1
#define _AD1CH1_CH19_POSN                                   0x1
#define _AD1CH1_CH19_POSITION                               0x1
#define _AD1CH1_CH19_SIZE                                   0x1
#define _AD1CH1_CH19_LENGTH                                 0x1
#define _AD1CH1_CH19_MASK                                   0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned CH18                   :1;
        unsigned CH19                   :1;
    };
} AAD1CH1bits_t;
extern volatile AAD1CH1bits_t AAD1CH1bits __at(0x71F);
// bitfield macros
#define _AAD1CH1_CH18_POSN                                  0x0
#define _AAD1CH1_CH18_POSITION                              0x0
#define _AAD1CH1_CH18_SIZE                                  0x1
#define _AAD1CH1_CH18_LENGTH                                0x1
#define _AAD1CH1_CH18_MASK                                  0x1
#define _AAD1CH1_CH19_POSN                                  0x1
#define _AAD1CH1_CH19_POSITION                              0x1
#define _AAD1CH1_CH19_SIZE                                  0x1
#define _AAD1CH1_CH19_LENGTH                                0x1
#define _AAD1CH1_CH19_MASK                                  0x2

// Register: AD2CON0
#define AD2CON0 AD2CON0
extern volatile unsigned char           AD2CON0             __at(0x791);
#ifndef _LIB_BUILD
asm("AD2CON0 equ 0791h");
#endif
// aliases
extern volatile unsigned char           AAD2CON0            __at(0x791);
#ifndef _LIB_BUILD
asm("AAD2CON0 equ 0791h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO                     :1;
        unsigned CHS                    :6;
    };
    struct {
        unsigned AD2ON                  :1;
        unsigned GO_nDONE               :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned CHS3                   :1;
        unsigned CHS4                   :1;
        unsigned CHS5                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE2              :1;
    };
} AD2CON0bits_t;
extern volatile AD2CON0bits_t AD2CON0bits __at(0x791);
// bitfield macros
#define _AD2CON0_ADON_POSN                                  0x0
#define _AD2CON0_ADON_POSITION                              0x0
#define _AD2CON0_ADON_SIZE                                  0x1
#define _AD2CON0_ADON_LENGTH                                0x1
#define _AD2CON0_ADON_MASK                                  0x1
#define _AD2CON0_GO_POSN                                    0x1
#define _AD2CON0_GO_POSITION                                0x1
#define _AD2CON0_GO_SIZE                                    0x1
#define _AD2CON0_GO_LENGTH                                  0x1
#define _AD2CON0_GO_MASK                                    0x2
#define _AD2CON0_CHS_POSN                                   0x2
#define _AD2CON0_CHS_POSITION                               0x2
#define _AD2CON0_CHS_SIZE                                   0x6
#define _AD2CON0_CHS_LENGTH                                 0x6
#define _AD2CON0_CHS_MASK                                   0xFC
#define _AD2CON0_AD2ON_POSN                                 0x0
#define _AD2CON0_AD2ON_POSITION                             0x0
#define _AD2CON0_AD2ON_SIZE                                 0x1
#define _AD2CON0_AD2ON_LENGTH                               0x1
#define _AD2CON0_AD2ON_MASK                                 0x1
#define _AD2CON0_GO_nDONE_POSN                              0x1
#define _AD2CON0_GO_nDONE_POSITION                          0x1
#define _AD2CON0_GO_nDONE_SIZE                              0x1
#define _AD2CON0_GO_nDONE_LENGTH                            0x1
#define _AD2CON0_GO_nDONE_MASK                              0x2
#define _AD2CON0_CHS0_POSN                                  0x2
#define _AD2CON0_CHS0_POSITION                              0x2
#define _AD2CON0_CHS0_SIZE                                  0x1
#define _AD2CON0_CHS0_LENGTH                                0x1
#define _AD2CON0_CHS0_MASK                                  0x4
#define _AD2CON0_CHS1_POSN                                  0x3
#define _AD2CON0_CHS1_POSITION                              0x3
#define _AD2CON0_CHS1_SIZE                                  0x1
#define _AD2CON0_CHS1_LENGTH                                0x1
#define _AD2CON0_CHS1_MASK                                  0x8
#define _AD2CON0_CHS2_POSN                                  0x4
#define _AD2CON0_CHS2_POSITION                              0x4
#define _AD2CON0_CHS2_SIZE                                  0x1
#define _AD2CON0_CHS2_LENGTH                                0x1
#define _AD2CON0_CHS2_MASK                                  0x10
#define _AD2CON0_CHS3_POSN                                  0x5
#define _AD2CON0_CHS3_POSITION                              0x5
#define _AD2CON0_CHS3_SIZE                                  0x1
#define _AD2CON0_CHS3_LENGTH                                0x1
#define _AD2CON0_CHS3_MASK                                  0x20
#define _AD2CON0_CHS4_POSN                                  0x6
#define _AD2CON0_CHS4_POSITION                              0x6
#define _AD2CON0_CHS4_SIZE                                  0x1
#define _AD2CON0_CHS4_LENGTH                                0x1
#define _AD2CON0_CHS4_MASK                                  0x40
#define _AD2CON0_CHS5_POSN                                  0x7
#define _AD2CON0_CHS5_POSITION                              0x7
#define _AD2CON0_CHS5_SIZE                                  0x1
#define _AD2CON0_CHS5_LENGTH                                0x1
#define _AD2CON0_CHS5_MASK                                  0x80
#define _AD2CON0_GO_nDONE2_POSN                             0x1
#define _AD2CON0_GO_nDONE2_POSITION                         0x1
#define _AD2CON0_GO_nDONE2_SIZE                             0x1
#define _AD2CON0_GO_nDONE2_LENGTH                           0x1
#define _AD2CON0_GO_nDONE2_MASK                             0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO                     :1;
        unsigned CHS                    :6;
    };
    struct {
        unsigned AD2ON                  :1;
        unsigned GO_nDONE               :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned CHS3                   :1;
        unsigned CHS4                   :1;
        unsigned CHS5                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE2              :1;
    };
} AAD2CON0bits_t;
extern volatile AAD2CON0bits_t AAD2CON0bits __at(0x791);
// bitfield macros
#define _AAD2CON0_ADON_POSN                                 0x0
#define _AAD2CON0_ADON_POSITION                             0x0
#define _AAD2CON0_ADON_SIZE                                 0x1
#define _AAD2CON0_ADON_LENGTH                               0x1
#define _AAD2CON0_ADON_MASK                                 0x1
#define _AAD2CON0_GO_POSN                                   0x1
#define _AAD2CON0_GO_POSITION                               0x1
#define _AAD2CON0_GO_SIZE                                   0x1
#define _AAD2CON0_GO_LENGTH                                 0x1
#define _AAD2CON0_GO_MASK                                   0x2
#define _AAD2CON0_CHS_POSN                                  0x2
#define _AAD2CON0_CHS_POSITION                              0x2
#define _AAD2CON0_CHS_SIZE                                  0x6
#define _AAD2CON0_CHS_LENGTH                                0x6
#define _AAD2CON0_CHS_MASK                                  0xFC
#define _AAD2CON0_AD2ON_POSN                                0x0
#define _AAD2CON0_AD2ON_POSITION                            0x0
#define _AAD2CON0_AD2ON_SIZE                                0x1
#define _AAD2CON0_AD2ON_LENGTH                              0x1
#define _AAD2CON0_AD2ON_MASK                                0x1
#define _AAD2CON0_GO_nDONE_POSN                             0x1
#define _AAD2CON0_GO_nDONE_POSITION                         0x1
#define _AAD2CON0_GO_nDONE_SIZE                             0x1
#define _AAD2CON0_GO_nDONE_LENGTH                           0x1
#define _AAD2CON0_GO_nDONE_MASK                             0x2
#define _AAD2CON0_CHS0_POSN                                 0x2
#define _AAD2CON0_CHS0_POSITION                             0x2
#define _AAD2CON0_CHS0_SIZE                                 0x1
#define _AAD2CON0_CHS0_LENGTH                               0x1
#define _AAD2CON0_CHS0_MASK                                 0x4
#define _AAD2CON0_CHS1_POSN                                 0x3
#define _AAD2CON0_CHS1_POSITION                             0x3
#define _AAD2CON0_CHS1_SIZE                                 0x1
#define _AAD2CON0_CHS1_LENGTH                               0x1
#define _AAD2CON0_CHS1_MASK                                 0x8
#define _AAD2CON0_CHS2_POSN                                 0x4
#define _AAD2CON0_CHS2_POSITION                             0x4
#define _AAD2CON0_CHS2_SIZE                                 0x1
#define _AAD2CON0_CHS2_LENGTH                               0x1
#define _AAD2CON0_CHS2_MASK                                 0x10
#define _AAD2CON0_CHS3_POSN                                 0x5
#define _AAD2CON0_CHS3_POSITION                             0x5
#define _AAD2CON0_CHS3_SIZE                                 0x1
#define _AAD2CON0_CHS3_LENGTH                               0x1
#define _AAD2CON0_CHS3_MASK                                 0x20
#define _AAD2CON0_CHS4_POSN                                 0x6
#define _AAD2CON0_CHS4_POSITION                             0x6
#define _AAD2CON0_CHS4_SIZE                                 0x1
#define _AAD2CON0_CHS4_LENGTH                               0x1
#define _AAD2CON0_CHS4_MASK                                 0x40
#define _AAD2CON0_CHS5_POSN                                 0x7
#define _AAD2CON0_CHS5_POSITION                             0x7
#define _AAD2CON0_CHS5_SIZE                                 0x1
#define _AAD2CON0_CHS5_LENGTH                               0x1
#define _AAD2CON0_CHS5_MASK                                 0x80
#define _AAD2CON0_GO_nDONE2_POSN                            0x1
#define _AAD2CON0_GO_nDONE2_POSITION                        0x1
#define _AAD2CON0_GO_nDONE2_SIZE                            0x1
#define _AAD2CON0_GO_nDONE2_LENGTH                          0x1
#define _AAD2CON0_GO_nDONE2_MASK                            0x2

// Register: AD2CON2
#define AD2CON2 AD2CON2
extern volatile unsigned char           AD2CON2             __at(0x793);
#ifndef _LIB_BUILD
asm("AD2CON2 equ 0793h");
#endif
// aliases
extern volatile unsigned char           AAD2CON2            __at(0x793);
#ifndef _LIB_BUILD
asm("AAD2CON2 equ 0793h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AD2CON2bits_t;
extern volatile AD2CON2bits_t AD2CON2bits __at(0x793);
// bitfield macros
#define _AD2CON2_TRIGSEL_POSN                               0x4
#define _AD2CON2_TRIGSEL_POSITION                           0x4
#define _AD2CON2_TRIGSEL_SIZE                               0x3
#define _AD2CON2_TRIGSEL_LENGTH                             0x3
#define _AD2CON2_TRIGSEL_MASK                               0x70
#define _AD2CON2_TRIGSEL0_POSN                              0x4
#define _AD2CON2_TRIGSEL0_POSITION                          0x4
#define _AD2CON2_TRIGSEL0_SIZE                              0x1
#define _AD2CON2_TRIGSEL0_LENGTH                            0x1
#define _AD2CON2_TRIGSEL0_MASK                              0x10
#define _AD2CON2_TRIGSEL1_POSN                              0x5
#define _AD2CON2_TRIGSEL1_POSITION                          0x5
#define _AD2CON2_TRIGSEL1_SIZE                              0x1
#define _AD2CON2_TRIGSEL1_LENGTH                            0x1
#define _AD2CON2_TRIGSEL1_MASK                              0x20
#define _AD2CON2_TRIGSEL2_POSN                              0x6
#define _AD2CON2_TRIGSEL2_POSITION                          0x6
#define _AD2CON2_TRIGSEL2_SIZE                              0x1
#define _AD2CON2_TRIGSEL2_LENGTH                            0x1
#define _AD2CON2_TRIGSEL2_MASK                              0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AAD2CON2bits_t;
extern volatile AAD2CON2bits_t AAD2CON2bits __at(0x793);
// bitfield macros
#define _AAD2CON2_TRIGSEL_POSN                              0x4
#define _AAD2CON2_TRIGSEL_POSITION                          0x4
#define _AAD2CON2_TRIGSEL_SIZE                              0x3
#define _AAD2CON2_TRIGSEL_LENGTH                            0x3
#define _AAD2CON2_TRIGSEL_MASK                              0x70
#define _AAD2CON2_TRIGSEL0_POSN                             0x4
#define _AAD2CON2_TRIGSEL0_POSITION                         0x4
#define _AAD2CON2_TRIGSEL0_SIZE                             0x1
#define _AAD2CON2_TRIGSEL0_LENGTH                           0x1
#define _AAD2CON2_TRIGSEL0_MASK                             0x10
#define _AAD2CON2_TRIGSEL1_POSN                             0x5
#define _AAD2CON2_TRIGSEL1_POSITION                         0x5
#define _AAD2CON2_TRIGSEL1_SIZE                             0x1
#define _AAD2CON2_TRIGSEL1_LENGTH                           0x1
#define _AAD2CON2_TRIGSEL1_MASK                             0x20
#define _AAD2CON2_TRIGSEL2_POSN                             0x6
#define _AAD2CON2_TRIGSEL2_POSITION                         0x6
#define _AAD2CON2_TRIGSEL2_SIZE                             0x1
#define _AAD2CON2_TRIGSEL2_LENGTH                           0x1
#define _AAD2CON2_TRIGSEL2_MASK                             0x40

