MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
// Register: AD2CON3
#define AD2CON3 AD2CON3
extern volatile unsigned char           AD2CON3             __at(0x794);
#ifndef _LIB_BUILD
asm("AD2CON3 equ 0794h");
#endif
// aliases
extern volatile unsigned char           AAD2CON3            __at(0x794);
#ifndef _LIB_BUILD
asm("AAD2CON3 equ 0794h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD2DSEN                :1;
        unsigned AD2IPEN                :1;
        unsigned                        :4;
        unsigned AD2IPPOL               :1;
        unsigned AD2EPPOL               :1;
    };
    struct {
        unsigned ADDSEN                 :1;
        unsigned ADIPEN                 :1;
        unsigned                        :4;
        unsigned ADIPPOL                :1;
        unsigned ADEPPOL                :1;
    };
} AD2CON3bits_t;
extern volatile AD2CON3bits_t AD2CON3bits __at(0x794);
// bitfield macros
#define _AD2CON3_AD2DSEN_POSN                               0x0
#define _AD2CON3_AD2DSEN_POSITION                           0x0
#define _AD2CON3_AD2DSEN_SIZE                               0x1
#define _AD2CON3_AD2DSEN_LENGTH                             0x1
#define _AD2CON3_AD2DSEN_MASK                               0x1
#define _AD2CON3_AD2IPEN_POSN                               0x1
#define _AD2CON3_AD2IPEN_POSITION                           0x1
#define _AD2CON3_AD2IPEN_SIZE                               0x1
#define _AD2CON3_AD2IPEN_LENGTH                             0x1
#define _AD2CON3_AD2IPEN_MASK                               0x2
#define _AD2CON3_AD2IPPOL_POSN                              0x6
#define _AD2CON3_AD2IPPOL_POSITION                          0x6
#define _AD2CON3_AD2IPPOL_SIZE                              0x1
#define _AD2CON3_AD2IPPOL_LENGTH                            0x1
#define _AD2CON3_AD2IPPOL_MASK                              0x40
#define _AD2CON3_AD2EPPOL_POSN                              0x7
#define _AD2CON3_AD2EPPOL_POSITION                          0x7
#define _AD2CON3_AD2EPPOL_SIZE                              0x1
#define _AD2CON3_AD2EPPOL_LENGTH                            0x1
#define _AD2CON3_AD2EPPOL_MASK                              0x80
#define _AD2CON3_ADDSEN_POSN                                0x0
#define _AD2CON3_ADDSEN_POSITION                            0x0
#define _AD2CON3_ADDSEN_SIZE                                0x1
#define _AD2CON3_ADDSEN_LENGTH                              0x1
#define _AD2CON3_ADDSEN_MASK                                0x1
#define _AD2CON3_ADIPEN_POSN                                0x1
#define _AD2CON3_ADIPEN_POSITION                            0x1
#define _AD2CON3_ADIPEN_SIZE                                0x1
#define _AD2CON3_ADIPEN_LENGTH                              0x1
#define _AD2CON3_ADIPEN_MASK                                0x2
#define _AD2CON3_ADIPPOL_POSN                               0x6
#define _AD2CON3_ADIPPOL_POSITION                           0x6
#define _AD2CON3_ADIPPOL_SIZE                               0x1
#define _AD2CON3_ADIPPOL_LENGTH                             0x1
#define _AD2CON3_ADIPPOL_MASK                               0x40
#define _AD2CON3_ADEPPOL_POSN                               0x7
#define _AD2CON3_ADEPPOL_POSITION                           0x7
#define _AD2CON3_ADEPPOL_SIZE                               0x1
#define _AD2CON3_ADEPPOL_LENGTH                             0x1
#define _AD2CON3_ADEPPOL_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned AD2DSEN                :1;
        unsigned AD2IPEN                :1;
        unsigned                        :4;
        unsigned AD2IPPOL               :1;
        unsigned AD2EPPOL               :1;
    };
    struct {
        unsigned ADDSEN                 :1;
        unsigned ADIPEN                 :1;
        unsigned                        :4;
        unsigned ADIPPOL                :1;
        unsigned ADEPPOL                :1;
    };
} AAD2CON3bits_t;
extern volatile AAD2CON3bits_t AAD2CON3bits __at(0x794);
// bitfield macros
#define _AAD2CON3_AD2DSEN_POSN                              0x0
#define _AAD2CON3_AD2DSEN_POSITION                          0x0
#define _AAD2CON3_AD2DSEN_SIZE                              0x1
#define _AAD2CON3_AD2DSEN_LENGTH                            0x1
#define _AAD2CON3_AD2DSEN_MASK                              0x1
#define _AAD2CON3_AD2IPEN_POSN                              0x1
#define _AAD2CON3_AD2IPEN_POSITION                          0x1
#define _AAD2CON3_AD2IPEN_SIZE                              0x1
#define _AAD2CON3_AD2IPEN_LENGTH                            0x1
#define _AAD2CON3_AD2IPEN_MASK                              0x2
#define _AAD2CON3_AD2IPPOL_POSN                             0x6
#define _AAD2CON3_AD2IPPOL_POSITION                         0x6
#define _AAD2CON3_AD2IPPOL_SIZE                             0x1
#define _AAD2CON3_AD2IPPOL_LENGTH                           0x1
#define _AAD2CON3_AD2IPPOL_MASK                             0x40
#define _AAD2CON3_AD2EPPOL_POSN                             0x7
#define _AAD2CON3_AD2EPPOL_POSITION                         0x7
#define _AAD2CON3_AD2EPPOL_SIZE                             0x1
#define _AAD2CON3_AD2EPPOL_LENGTH                           0x1
#define _AAD2CON3_AD2EPPOL_MASK                             0x80
#define _AAD2CON3_ADDSEN_POSN                               0x0
#define _AAD2CON3_ADDSEN_POSITION                           0x0
#define _AAD2CON3_ADDSEN_SIZE                               0x1
#define _AAD2CON3_ADDSEN_LENGTH                             0x1
#define _AAD2CON3_ADDSEN_MASK                               0x1
#define _AAD2CON3_ADIPEN_POSN                               0x1
#define _AAD2CON3_ADIPEN_POSITION                           0x1
#define _AAD2CON3_ADIPEN_SIZE                               0x1
#define _AAD2CON3_ADIPEN_LENGTH                             0x1
#define _AAD2CON3_ADIPEN_MASK                               0x2
#define _AAD2CON3_ADIPPOL_POSN                              0x6
#define _AAD2CON3_ADIPPOL_POSITION                          0x6
#define _AAD2CON3_ADIPPOL_SIZE                              0x1
#define _AAD2CON3_ADIPPOL_LENGTH                            0x1
#define _AAD2CON3_ADIPPOL_MASK                              0x40
#define _AAD2CON3_ADEPPOL_POSN                              0x7
#define _AAD2CON3_ADEPPOL_POSITION                          0x7
#define _AAD2CON3_ADEPPOL_SIZE                              0x1
#define _AAD2CON3_ADEPPOL_LENGTH                            0x1
#define _AAD2CON3_ADEPPOL_MASK                              0x80

