MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
// Register: AD2PRECON
#define AD2PRECON AD2PRECON
extern volatile unsigned char           AD2PRECON           __at(0x796);
#ifndef _LIB_BUILD
asm("AD2PRECON equ 0796h");
#endif
// aliases
extern volatile unsigned char           AD2PRE              __at(0x796);
#ifndef _LIB_BUILD
asm("AD2PRE equ 0796h");
#endif
extern volatile unsigned char           AAD2PRE             __at(0x796);
#ifndef _LIB_BUILD
asm("AAD2PRE equ 0796h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPRE                  :7;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
} AD2PRECONbits_t;
extern volatile AD2PRECONbits_t AD2PRECONbits __at(0x796);
// bitfield macros
#define _AD2PRECON_ADPRE_POSN                               0x0
#define _AD2PRECON_ADPRE_POSITION                           0x0
#define _AD2PRECON_ADPRE_SIZE                               0x7
#define _AD2PRECON_ADPRE_LENGTH                             0x7
#define _AD2PRECON_ADPRE_MASK                               0x7F
#define _AD2PRECON_ADPRE0_POSN                              0x0
#define _AD2PRECON_ADPRE0_POSITION                          0x0
#define _AD2PRECON_ADPRE0_SIZE                              0x1
#define _AD2PRECON_ADPRE0_LENGTH                            0x1
#define _AD2PRECON_ADPRE0_MASK                              0x1
#define _AD2PRECON_ADPRE1_POSN                              0x1
#define _AD2PRECON_ADPRE1_POSITION                          0x1
#define _AD2PRECON_ADPRE1_SIZE                              0x1
#define _AD2PRECON_ADPRE1_LENGTH                            0x1
#define _AD2PRECON_ADPRE1_MASK                              0x2
#define _AD2PRECON_ADPRE2_POSN                              0x2
#define _AD2PRECON_ADPRE2_POSITION                          0x2
#define _AD2PRECON_ADPRE2_SIZE                              0x1
#define _AD2PRECON_ADPRE2_LENGTH                            0x1
#define _AD2PRECON_ADPRE2_MASK                              0x4
#define _AD2PRECON_ADPRE3_POSN                              0x3
#define _AD2PRECON_ADPRE3_POSITION                          0x3
#define _AD2PRECON_ADPRE3_SIZE                              0x1
#define _AD2PRECON_ADPRE3_LENGTH                            0x1
#define _AD2PRECON_ADPRE3_MASK                              0x8
#define _AD2PRECON_ADPRE4_POSN                              0x4
#define _AD2PRECON_ADPRE4_POSITION                          0x4
#define _AD2PRECON_ADPRE4_SIZE                              0x1
#define _AD2PRECON_ADPRE4_LENGTH                            0x1
#define _AD2PRECON_ADPRE4_MASK                              0x10
#define _AD2PRECON_ADPRE5_POSN                              0x5
#define _AD2PRECON_ADPRE5_POSITION                          0x5
#define _AD2PRECON_ADPRE5_SIZE                              0x1
#define _AD2PRECON_ADPRE5_LENGTH                            0x1
#define _AD2PRECON_ADPRE5_MASK                              0x20
#define _AD2PRECON_ADPRE6_POSN                              0x6
#define _AD2PRECON_ADPRE6_POSITION                          0x6
#define _AD2PRECON_ADPRE6_SIZE                              0x1
#define _AD2PRECON_ADPRE6_LENGTH                            0x1
#define _AD2PRECON_ADPRE6_MASK                              0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADPRE                  :7;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
} AD2PREbits_t;
extern volatile AD2PREbits_t AD2PREbits __at(0x796);
// bitfield macros
#define _AD2PRE_ADPRE_POSN                                  0x0
#define _AD2PRE_ADPRE_POSITION                              0x0
#define _AD2PRE_ADPRE_SIZE                                  0x7
#define _AD2PRE_ADPRE_LENGTH                                0x7
#define _AD2PRE_ADPRE_MASK                                  0x7F
#define _AD2PRE_ADPRE0_POSN                                 0x0
#define _AD2PRE_ADPRE0_POSITION                             0x0
#define _AD2PRE_ADPRE0_SIZE                                 0x1
#define _AD2PRE_ADPRE0_LENGTH                               0x1
#define _AD2PRE_ADPRE0_MASK                                 0x1
#define _AD2PRE_ADPRE1_POSN                                 0x1
#define _AD2PRE_ADPRE1_POSITION                             0x1
#define _AD2PRE_ADPRE1_SIZE                                 0x1
#define _AD2PRE_ADPRE1_LENGTH                               0x1
#define _AD2PRE_ADPRE1_MASK                                 0x2
#define _AD2PRE_ADPRE2_POSN                                 0x2
#define _AD2PRE_ADPRE2_POSITION                             0x2
#define _AD2PRE_ADPRE2_SIZE                                 0x1
#define _AD2PRE_ADPRE2_LENGTH                               0x1
#define _AD2PRE_ADPRE2_MASK                                 0x4
#define _AD2PRE_ADPRE3_POSN                                 0x3
#define _AD2PRE_ADPRE3_POSITION                             0x3
#define _AD2PRE_ADPRE3_SIZE                                 0x1
#define _AD2PRE_ADPRE3_LENGTH                               0x1
#define _AD2PRE_ADPRE3_MASK                                 0x8
#define _AD2PRE_ADPRE4_POSN                                 0x4
#define _AD2PRE_ADPRE4_POSITION                             0x4
#define _AD2PRE_ADPRE4_SIZE                                 0x1
#define _AD2PRE_ADPRE4_LENGTH                               0x1
#define _AD2PRE_ADPRE4_MASK                                 0x10
#define _AD2PRE_ADPRE5_POSN                                 0x5
#define _AD2PRE_ADPRE5_POSITION                             0x5
#define _AD2PRE_ADPRE5_SIZE                                 0x1
#define _AD2PRE_ADPRE5_LENGTH                               0x1
#define _AD2PRE_ADPRE5_MASK                                 0x20
#define _AD2PRE_ADPRE6_POSN                                 0x6
#define _AD2PRE_ADPRE6_POSITION                             0x6
#define _AD2PRE_ADPRE6_SIZE                                 0x1
#define _AD2PRE_ADPRE6_LENGTH                               0x1
#define _AD2PRE_ADPRE6_MASK                                 0x40
typedef union {
    struct {
        unsigned ADPRE                  :7;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
} AAD2PREbits_t;
