MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
// Register: AD2GRD
#define AD2GRD AD2GRD
extern volatile unsigned char           AD2GRD              __at(0x798);
#ifndef _LIB_BUILD
asm("AD2GRD equ 0798h");
#endif
// aliases
extern volatile unsigned char           AAD2GRD             __at(0x798);
#ifndef _LIB_BUILD
asm("AAD2GRD equ 0798h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2POL                 :1;
        unsigned                        :4;
        unsigned GRD2POL                :1;
        unsigned GRD2AOE                :1;
        unsigned GRD2BOE                :1;
    };
    struct {
        unsigned TXPOL                  :1;
        unsigned                        :4;
        unsigned GRDPOL                 :1;
        unsigned GRDAOE                 :1;
        unsigned GRDBOE                 :1;
    };
} AD2GRDbits_t;
extern volatile AD2GRDbits_t AD2GRDbits __at(0x798);
// bitfield macros
#define _AD2GRD_TX2POL_POSN                                 0x0
#define _AD2GRD_TX2POL_POSITION                             0x0
#define _AD2GRD_TX2POL_SIZE                                 0x1
#define _AD2GRD_TX2POL_LENGTH                               0x1
#define _AD2GRD_TX2POL_MASK                                 0x1
#define _AD2GRD_GRD2POL_POSN                                0x5
#define _AD2GRD_GRD2POL_POSITION                            0x5
#define _AD2GRD_GRD2POL_SIZE                                0x1
#define _AD2GRD_GRD2POL_LENGTH                              0x1
#define _AD2GRD_GRD2POL_MASK                                0x20
#define _AD2GRD_GRD2AOE_POSN                                0x6
#define _AD2GRD_GRD2AOE_POSITION                            0x6
#define _AD2GRD_GRD2AOE_SIZE                                0x1
#define _AD2GRD_GRD2AOE_LENGTH                              0x1
#define _AD2GRD_GRD2AOE_MASK                                0x40
#define _AD2GRD_GRD2BOE_POSN                                0x7
#define _AD2GRD_GRD2BOE_POSITION                            0x7
#define _AD2GRD_GRD2BOE_SIZE                                0x1
#define _AD2GRD_GRD2BOE_LENGTH                              0x1
#define _AD2GRD_GRD2BOE_MASK                                0x80
#define _AD2GRD_TXPOL_POSN                                  0x0
#define _AD2GRD_TXPOL_POSITION                              0x0
#define _AD2GRD_TXPOL_SIZE                                  0x1
#define _AD2GRD_TXPOL_LENGTH                                0x1
#define _AD2GRD_TXPOL_MASK                                  0x1
#define _AD2GRD_GRDPOL_POSN                                 0x5
#define _AD2GRD_GRDPOL_POSITION                             0x5
#define _AD2GRD_GRDPOL_SIZE                                 0x1
#define _AD2GRD_GRDPOL_LENGTH                               0x1
#define _AD2GRD_GRDPOL_MASK                                 0x20
#define _AD2GRD_GRDAOE_POSN                                 0x6
#define _AD2GRD_GRDAOE_POSITION                             0x6
#define _AD2GRD_GRDAOE_SIZE                                 0x1
#define _AD2GRD_GRDAOE_LENGTH                               0x1
#define _AD2GRD_GRDAOE_MASK                                 0x40
#define _AD2GRD_GRDBOE_POSN                                 0x7
#define _AD2GRD_GRDBOE_POSITION                             0x7
#define _AD2GRD_GRDBOE_SIZE                                 0x1
#define _AD2GRD_GRDBOE_LENGTH                               0x1
#define _AD2GRD_GRDBOE_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX2POL                 :1;
        unsigned                        :4;
        unsigned GRD2POL                :1;
        unsigned GRD2AOE                :1;
        unsigned GRD2BOE                :1;
    };
    struct {
        unsigned TXPOL                  :1;
        unsigned                        :4;
        unsigned GRDPOL                 :1;
        unsigned GRDAOE                 :1;
        unsigned GRDBOE                 :1;
    };
} AAD2GRDbits_t;
extern volatile AAD2GRDbits_t AAD2GRDbits __at(0x798);
// bitfield macros
#define _AAD2GRD_TX2POL_POSN                                0x0
#define _AAD2GRD_TX2POL_POSITION                            0x0
#define _AAD2GRD_TX2POL_SIZE                                0x1
#define _AAD2GRD_TX2POL_LENGTH                              0x1
#define _AAD2GRD_TX2POL_MASK                                0x1
#define _AAD2GRD_GRD2POL_POSN                               0x5
#define _AAD2GRD_GRD2POL_POSITION                           0x5
#define _AAD2GRD_GRD2POL_SIZE                               0x1
#define _AAD2GRD_GRD2POL_LENGTH                             0x1
#define _AAD2GRD_GRD2POL_MASK                               0x20
#define _AAD2GRD_GRD2AOE_POSN                               0x6
#define _AAD2GRD_GRD2AOE_POSITION                           0x6
#define _AAD2GRD_GRD2AOE_SIZE                               0x1
#define _AAD2GRD_GRD2AOE_LENGTH                             0x1
#define _AAD2GRD_GRD2AOE_MASK                               0x40
#define _AAD2GRD_GRD2BOE_POSN                               0x7
#define _AAD2GRD_GRD2BOE_POSITION                           0x7
#define _AAD2GRD_GRD2BOE_SIZE                               0x1
#define _AAD2GRD_GRD2BOE_LENGTH                             0x1
#define _AAD2GRD_GRD2BOE_MASK                               0x80
#define _AAD2GRD_TXPOL_POSN                                 0x0
#define _AAD2GRD_TXPOL_POSITION                             0x0
#define _AAD2GRD_TXPOL_SIZE                                 0x1
#define _AAD2GRD_TXPOL_LENGTH                               0x1
#define _AAD2GRD_TXPOL_MASK                                 0x1
#define _AAD2GRD_GRDPOL_POSN                                0x5
#define _AAD2GRD_GRDPOL_POSITION                            0x5
#define _AAD2GRD_GRDPOL_SIZE                                0x1
#define _AAD2GRD_GRDPOL_LENGTH                              0x1
#define _AAD2GRD_GRDPOL_MASK                                0x20
#define _AAD2GRD_GRDAOE_POSN                                0x6
#define _AAD2GRD_GRDAOE_POSITION                            0x6
#define _AAD2GRD_GRDAOE_SIZE                                0x1
#define _AAD2GRD_GRDAOE_LENGTH                              0x1
#define _AAD2GRD_GRDAOE_MASK                                0x40
#define _AAD2GRD_GRDBOE_POSN                                0x7
#define _AAD2GRD_GRDBOE_POSITION                            0x7
#define _AAD2GRD_GRDBOE_SIZE                                0x1
#define _AAD2GRD_GRDBOE_LENGTH                              0x1
#define _AAD2GRD_GRDBOE_MASK                                0x80

// Register: AD2CAPCON
#define AD2CAPCON AD2CAPCON
extern volatile unsigned char           AD2CAPCON           __at(0x799);
#ifndef _LIB_BUILD
asm("AD2CAPCON equ 0799h");
#endif
// aliases
extern volatile unsigned char           AAD2CAP             __at(0x799);
#ifndef _LIB_BUILD
asm("AAD2CAP equ 0799h");
#endif
extern volatile unsigned char           AAD2CAPCON          __at(0x799);
#ifndef _LIB_BUILD
asm("AAD2CAPCON equ 0799h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDCAP                 :4;
    };
    struct {
        unsigned ADCAP                  :4;
    };
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
        unsigned ADDCAP3                :1;
    };
    struct {
        unsigned ADD2CAP                :4;
    };
} AD2CAPCONbits_t;
extern volatile AD2CAPCONbits_t AD2CAPCONbits __at(0x799);
// bitfield macros
#define _AD2CAPCON_ADDCAP_POSN                              0x0
#define _AD2CAPCON_ADDCAP_POSITION                          0x0
#define _AD2CAPCON_ADDCAP_SIZE                              0x4
#define _AD2CAPCON_ADDCAP_LENGTH                            0x4
#define _AD2CAPCON_ADDCAP_MASK                              0xF
#define _AD2CAPCON_ADCAP_POSN                               0x0
#define _AD2CAPCON_ADCAP_POSITION                           0x0
#define _AD2CAPCON_ADCAP_SIZE                               0x4
#define _AD2CAPCON_ADCAP_LENGTH                             0x4
#define _AD2CAPCON_ADCAP_MASK                               0xF
#define _AD2CAPCON_ADDCAP0_POSN                             0x0
#define _AD2CAPCON_ADDCAP0_POSITION                         0x0
#define _AD2CAPCON_ADDCAP0_SIZE                             0x1
#define _AD2CAPCON_ADDCAP0_LENGTH                           0x1
#define _AD2CAPCON_ADDCAP0_MASK                             0x1
#define _AD2CAPCON_ADDCAP1_POSN                             0x1
#define _AD2CAPCON_ADDCAP1_POSITION                         0x1
#define _AD2CAPCON_ADDCAP1_SIZE                             0x1
#define _AD2CAPCON_ADDCAP1_LENGTH                           0x1
#define _AD2CAPCON_ADDCAP1_MASK                             0x2
#define _AD2CAPCON_ADDCAP2_POSN                             0x2
#define _AD2CAPCON_ADDCAP2_POSITION                         0x2
#define _AD2CAPCON_ADDCAP2_SIZE                             0x1
#define _AD2CAPCON_ADDCAP2_LENGTH                           0x1
#define _AD2CAPCON_ADDCAP2_MASK                             0x4
#define _AD2CAPCON_ADDCAP3_POSN                             0x3
#define _AD2CAPCON_ADDCAP3_POSITION                         0x3
#define _AD2CAPCON_ADDCAP3_SIZE                             0x1
#define _AD2CAPCON_ADDCAP3_LENGTH                           0x1
#define _AD2CAPCON_ADDCAP3_MASK                             0x8
#define _AD2CAPCON_ADD2CAP_POSN                             0x0
#define _AD2CAPCON_ADD2CAP_POSITION                         0x0
#define _AD2CAPCON_ADD2CAP_SIZE                             0x4
#define _AD2CAPCON_ADD2CAP_LENGTH                           0x4
#define _AD2CAPCON_ADD2CAP_MASK                             0xF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADDCAP                 :4;
    };
    struct {
        unsigned ADCAP                  :4;
    };
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
        unsigned ADDCAP3                :1;
    };
    struct {
        unsigned ADD2CAP                :4;
    };
} AAD2CAPbits_t;
extern volatile AAD2CAPbits_t AAD2CAPbits __at(0x799);
// bitfield macros
#define _AAD2CAP_ADDCAP_POSN                                0x0
#define _AAD2CAP_ADDCAP_POSITION                            0x0
#define _AAD2CAP_ADDCAP_SIZE                                0x4
#define _AAD2CAP_ADDCAP_LENGTH                              0x4
#define _AAD2CAP_ADDCAP_MASK                                0xF
#define _AAD2CAP_ADCAP_POSN                                 0x0
#define _AAD2CAP_ADCAP_POSITION                             0x0
#define _AAD2CAP_ADCAP_SIZE                                 0x4
#define _AAD2CAP_ADCAP_LENGTH                               0x4
#define _AAD2CAP_ADCAP_MASK                                 0xF
#define _AAD2CAP_ADDCAP0_POSN                               0x0
#define _AAD2CAP_ADDCAP0_POSITION                           0x0
#define _AAD2CAP_ADDCAP0_SIZE                               0x1
#define _AAD2CAP_ADDCAP0_LENGTH                             0x1
#define _AAD2CAP_ADDCAP0_MASK                               0x1
#define _AAD2CAP_ADDCAP1_POSN                               0x1
#define _AAD2CAP_ADDCAP1_POSITION                           0x1
#define _AAD2CAP_ADDCAP1_SIZE                               0x1
#define _AAD2CAP_ADDCAP1_LENGTH                             0x1
#define _AAD2CAP_ADDCAP1_MASK                               0x2
#define _AAD2CAP_ADDCAP2_POSN                               0x2
#define _AAD2CAP_ADDCAP2_POSITION                           0x2
#define _AAD2CAP_ADDCAP2_SIZE                               0x1
#define _AAD2CAP_ADDCAP2_LENGTH                             0x1
#define _AAD2CAP_ADDCAP2_MASK                               0x4
#define _AAD2CAP_ADDCAP3_POSN                               0x3
#define _AAD2CAP_ADDCAP3_POSITION                           0x3
#define _AAD2CAP_ADDCAP3_SIZE                               0x1
#define _AAD2CAP_ADDCAP3_LENGTH                             0x1
#define _AAD2CAP_ADDCAP3_MASK                               0x8
#define _AAD2CAP_ADD2CAP_POSN                               0x0
#define _AAD2CAP_ADD2CAP_POSITION                           0x0
#define _AAD2CAP_ADD2CAP_SIZE                               0x4
#define _AAD2CAP_ADD2CAP_LENGTH                             0x4
#define _AAD2CAP_ADD2CAP_MASK                               0xF
typedef union {
    struct {
        unsigned ADDCAP                 :4;
    };
    struct {
        unsigned ADCAP                  :4;
    };
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
        unsigned ADDCAP3                :1;
    };
    struct {
        unsigned ADD2CAP                :4;
    };
} AAD2CAPCONbits_t;
extern volatile AAD2CAPCONbits_t AAD2CAPCONbits __at(0x799);
// bitfield macros
#define _AAD2CAPCON_ADDCAP_POSN                             0x0
#define _AAD2CAPCON_ADDCAP_POSITION                         0x0
#define _AAD2CAPCON_ADDCAP_SIZE                             0x4
#define _AAD2CAPCON_ADDCAP_LENGTH                           0x4
#define _AAD2CAPCON_ADDCAP_MASK                             0xF
#define _AAD2CAPCON_ADCAP_POSN                              0x0
#define _AAD2CAPCON_ADCAP_POSITION                          0x0
#define _AAD2CAPCON_ADCAP_SIZE                              0x4
#define _AAD2CAPCON_ADCAP_LENGTH                            0x4
#define _AAD2CAPCON_ADCAP_MASK                              0xF
#define _AAD2CAPCON_ADDCAP0_POSN                            0x0
#define _AAD2CAPCON_ADDCAP0_POSITION                        0x0
#define _AAD2CAPCON_ADDCAP0_SIZE                            0x1
#define _AAD2CAPCON_ADDCAP0_LENGTH                          0x1
#define _AAD2CAPCON_ADDCAP0_MASK                            0x1
#define _AAD2CAPCON_ADDCAP1_POSN                            0x1
#define _AAD2CAPCON_ADDCAP1_POSITION                        0x1
#define _AAD2CAPCON_ADDCAP1_SIZE                            0x1
#define _AAD2CAPCON_ADDCAP1_LENGTH                          0x1
#define _AAD2CAPCON_ADDCAP1_MASK                            0x2
#define _AAD2CAPCON_ADDCAP2_POSN                            0x2
#define _AAD2CAPCON_ADDCAP2_POSITION                        0x2
#define _AAD2CAPCON_ADDCAP2_SIZE                            0x1
#define _AAD2CAPCON_ADDCAP2_LENGTH                          0x1
#define _AAD2CAPCON_ADDCAP2_MASK                            0x4
#define _AAD2CAPCON_ADDCAP3_POSN                            0x3
#define _AAD2CAPCON_ADDCAP3_POSITION                        0x3
#define _AAD2CAPCON_ADDCAP3_SIZE                            0x1
#define _AAD2CAPCON_ADDCAP3_LENGTH                          0x1
#define _AAD2CAPCON_ADDCAP3_MASK                            0x8
#define _AAD2CAPCON_ADD2CAP_POSN                            0x0
#define _AAD2CAPCON_ADD2CAP_POSITION                        0x0
#define _AAD2CAPCON_ADD2CAP_SIZE                            0x4
#define _AAD2CAPCON_ADD2CAP_LENGTH                          0x4
#define _AAD2CAPCON_ADD2CAP_MASK                            0xF

// Register: AAD2RES0
#define AAD2RES0 AAD2RES0
extern volatile unsigned short          AAD2RES0            __at(0x79A);
#ifndef _LIB_BUILD
asm("AAD2RES0 equ 079Ah");
#endif
// aliases
extern volatile unsigned short          AD2RES0             __at(0x79A);
#ifndef _LIB_BUILD
asm("AD2RES0 equ 079Ah");
#endif

// Register: AAD2RES0L
#define AAD2RES0L AAD2RES0L
extern volatile unsigned char           AAD2RES0L           __at(0x79A);
#ifndef _LIB_BUILD
asm("AAD2RES0L equ 079Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AAD2RES0Lbits_t;
extern volatile AAD2RES0Lbits_t AAD2RES0Lbits __at(0x79A);
// bitfield macros
#define _AAD2RES0L_ADRESL_POSN                              0x0
#define _AAD2RES0L_ADRESL_POSITION                          0x0
#define _AAD2RES0L_ADRESL_SIZE                              0x8
#define _AAD2RES0L_ADRESL_LENGTH                            0x8
#define _AAD2RES0L_ADRESL_MASK                              0xFF

