MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
// Register: AAD2RES0H
#define AAD2RES0H AAD2RES0H
extern volatile unsigned char           AAD2RES0H           __at(0x79B);
#ifndef _LIB_BUILD
asm("AAD2RES0H equ 079Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AAD2RES0Hbits_t;
extern volatile AAD2RES0Hbits_t AAD2RES0Hbits __at(0x79B);
// bitfield macros
#define _AAD2RES0H_ADRESH_POSN                              0x0
#define _AAD2RES0H_ADRESH_POSITION                          0x0
#define _AAD2RES0H_ADRESH_SIZE                              0x8
#define _AAD2RES0H_ADRESH_LENGTH                            0x8
#define _AAD2RES0H_ADRESH_MASK                              0xFF

// Register: AAD2RES1
#define AAD2RES1 AAD2RES1
extern volatile unsigned short          AAD2RES1            __at(0x79C);
#ifndef _LIB_BUILD
asm("AAD2RES1 equ 079Ch");
#endif
// aliases
extern volatile unsigned short          AD2RES1             __at(0x79C);
#ifndef _LIB_BUILD
asm("AD2RES1 equ 079Ch");
#endif

// Register: AAD2RES1L
#define AAD2RES1L AAD2RES1L
extern volatile unsigned char           AAD2RES1L           __at(0x79C);
#ifndef _LIB_BUILD
asm("AAD2RES1L equ 079Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AAD2RES1Lbits_t;
extern volatile AAD2RES1Lbits_t AAD2RES1Lbits __at(0x79C);
// bitfield macros
#define _AAD2RES1L_ADRESL_POSN                              0x0
#define _AAD2RES1L_ADRESL_POSITION                          0x0
#define _AAD2RES1L_ADRESL_SIZE                              0x8
#define _AAD2RES1L_ADRESL_LENGTH                            0x8
#define _AAD2RES1L_ADRESL_MASK                              0xFF

// Register: AAD2RES1H
#define AAD2RES1H AAD2RES1H
extern volatile unsigned char           AAD2RES1H           __at(0x79D);
#ifndef _LIB_BUILD
asm("AAD2RES1H equ 079Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AAD2RES1Hbits_t;
extern volatile AAD2RES1Hbits_t AAD2RES1Hbits __at(0x79D);
// bitfield macros
#define _AAD2RES1H_ADRESH_POSN                              0x0
#define _AAD2RES1H_ADRESH_POSITION                          0x0
#define _AAD2RES1H_ADRESH_SIZE                              0x8
#define _AAD2RES1H_ADRESH_LENGTH                            0x8
#define _AAD2RES1H_ADRESH_MASK                              0xFF

// Register: AD2CH
#define AD2CH AD2CH
extern volatile unsigned short          AD2CH               __at(0x79E);
#ifndef _LIB_BUILD
asm("AD2CH equ 079Eh");
#endif
// aliases
extern volatile unsigned short          AAD2CH              __at(0x79E);
#ifndef _LIB_BUILD
asm("AAD2CH equ 079Eh");
#endif

// Register: AD2CH0
#define AD2CH0 AD2CH0
extern volatile unsigned char           AD2CH0              __at(0x79E);
#ifndef _LIB_BUILD
asm("AD2CH0 equ 079Eh");
#endif
// aliases
extern volatile unsigned char           AAD2CH0             __at(0x79E);
#ifndef _LIB_BUILD
asm("AAD2CH0 equ 079Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH20                   :1;
        unsigned CH21                   :1;
        unsigned CH22                   :1;
        unsigned CH23                   :1;
        unsigned CH24                   :1;
        unsigned CH25                   :1;
        unsigned CH26                   :1;
        unsigned CH27                   :1;
    };
} AD2CH0bits_t;
extern volatile AD2CH0bits_t AD2CH0bits __at(0x79E);
// bitfield macros
#define _AD2CH0_CH20_POSN                                   0x0
#define _AD2CH0_CH20_POSITION                               0x0
#define _AD2CH0_CH20_SIZE                                   0x1
#define _AD2CH0_CH20_LENGTH                                 0x1
#define _AD2CH0_CH20_MASK                                   0x1
#define _AD2CH0_CH21_POSN                                   0x1
#define _AD2CH0_CH21_POSITION                               0x1
#define _AD2CH0_CH21_SIZE                                   0x1
#define _AD2CH0_CH21_LENGTH                                 0x1
#define _AD2CH0_CH21_MASK                                   0x2
#define _AD2CH0_CH22_POSN                                   0x2
#define _AD2CH0_CH22_POSITION                               0x2
#define _AD2CH0_CH22_SIZE                                   0x1
#define _AD2CH0_CH22_LENGTH                                 0x1
#define _AD2CH0_CH22_MASK                                   0x4
#define _AD2CH0_CH23_POSN                                   0x3
#define _AD2CH0_CH23_POSITION                               0x3
#define _AD2CH0_CH23_SIZE                                   0x1
#define _AD2CH0_CH23_LENGTH                                 0x1
#define _AD2CH0_CH23_MASK                                   0x8
#define _AD2CH0_CH24_POSN                                   0x4
#define _AD2CH0_CH24_POSITION                               0x4
#define _AD2CH0_CH24_SIZE                                   0x1
#define _AD2CH0_CH24_LENGTH                                 0x1
#define _AD2CH0_CH24_MASK                                   0x10
#define _AD2CH0_CH25_POSN                                   0x5
#define _AD2CH0_CH25_POSITION                               0x5
#define _AD2CH0_CH25_SIZE                                   0x1
#define _AD2CH0_CH25_LENGTH                                 0x1
#define _AD2CH0_CH25_MASK                                   0x20
#define _AD2CH0_CH26_POSN                                   0x6
#define _AD2CH0_CH26_POSITION                               0x6
#define _AD2CH0_CH26_SIZE                                   0x1
#define _AD2CH0_CH26_LENGTH                                 0x1
#define _AD2CH0_CH26_MASK                                   0x40
#define _AD2CH0_CH27_POSN                                   0x7
#define _AD2CH0_CH27_POSITION                               0x7
#define _AD2CH0_CH27_SIZE                                   0x1
#define _AD2CH0_CH27_LENGTH                                 0x1
#define _AD2CH0_CH27_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned CH20                   :1;
        unsigned CH21                   :1;
        unsigned CH22                   :1;
        unsigned CH23                   :1;
        unsigned CH24                   :1;
        unsigned CH25                   :1;
        unsigned CH26                   :1;
        unsigned CH27                   :1;
    };
} AAD2CH0bits_t;
