MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
extern volatile AAD2CH0bits_t AAD2CH0bits __at(0x79E);
// bitfield macros
#define _AAD2CH0_CH20_POSN                                  0x0
#define _AAD2CH0_CH20_POSITION                              0x0
#define _AAD2CH0_CH20_SIZE                                  0x1
#define _AAD2CH0_CH20_LENGTH                                0x1
#define _AAD2CH0_CH20_MASK                                  0x1
#define _AAD2CH0_CH21_POSN                                  0x1
#define _AAD2CH0_CH21_POSITION                              0x1
#define _AAD2CH0_CH21_SIZE                                  0x1
#define _AAD2CH0_CH21_LENGTH                                0x1
#define _AAD2CH0_CH21_MASK                                  0x2
#define _AAD2CH0_CH22_POSN                                  0x2
#define _AAD2CH0_CH22_POSITION                              0x2
#define _AAD2CH0_CH22_SIZE                                  0x1
#define _AAD2CH0_CH22_LENGTH                                0x1
#define _AAD2CH0_CH22_MASK                                  0x4
#define _AAD2CH0_CH23_POSN                                  0x3
#define _AAD2CH0_CH23_POSITION                              0x3
#define _AAD2CH0_CH23_SIZE                                  0x1
#define _AAD2CH0_CH23_LENGTH                                0x1
#define _AAD2CH0_CH23_MASK                                  0x8
#define _AAD2CH0_CH24_POSN                                  0x4
#define _AAD2CH0_CH24_POSITION                              0x4
#define _AAD2CH0_CH24_SIZE                                  0x1
#define _AAD2CH0_CH24_LENGTH                                0x1
#define _AAD2CH0_CH24_MASK                                  0x10
#define _AAD2CH0_CH25_POSN                                  0x5
#define _AAD2CH0_CH25_POSITION                              0x5
#define _AAD2CH0_CH25_SIZE                                  0x1
#define _AAD2CH0_CH25_LENGTH                                0x1
#define _AAD2CH0_CH25_MASK                                  0x20
#define _AAD2CH0_CH26_POSN                                  0x6
#define _AAD2CH0_CH26_POSITION                              0x6
#define _AAD2CH0_CH26_SIZE                                  0x1
#define _AAD2CH0_CH26_LENGTH                                0x1
#define _AAD2CH0_CH26_MASK                                  0x40
#define _AAD2CH0_CH27_POSN                                  0x7
#define _AAD2CH0_CH27_POSITION                              0x7
#define _AAD2CH0_CH27_SIZE                                  0x1
#define _AAD2CH0_CH27_LENGTH                                0x1
#define _AAD2CH0_CH27_MASK                                  0x80

// Register: AD2CH1
#define AD2CH1 AD2CH1
extern volatile unsigned char           AD2CH1              __at(0x79F);
#ifndef _LIB_BUILD
asm("AD2CH1 equ 079Fh");
#endif
// aliases
extern volatile unsigned char           AAD2CH1             __at(0x79F);
#ifndef _LIB_BUILD
asm("AAD2CH1 equ 079Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH28                   :1;
        unsigned CH29                   :1;
        unsigned CH40                   :1;
    };
} AD2CH1bits_t;
extern volatile AD2CH1bits_t AD2CH1bits __at(0x79F);
// bitfield macros
#define _AD2CH1_CH28_POSN                                   0x0
#define _AD2CH1_CH28_POSITION                               0x0
#define _AD2CH1_CH28_SIZE                                   0x1
#define _AD2CH1_CH28_LENGTH                                 0x1
#define _AD2CH1_CH28_MASK                                   0x1
#define _AD2CH1_CH29_POSN                                   0x1
#define _AD2CH1_CH29_POSITION                               0x1
#define _AD2CH1_CH29_SIZE                                   0x1
#define _AD2CH1_CH29_LENGTH                                 0x1
#define _AD2CH1_CH29_MASK                                   0x2
#define _AD2CH1_CH40_POSN                                   0x2
#define _AD2CH1_CH40_POSITION                               0x2
#define _AD2CH1_CH40_SIZE                                   0x1
#define _AD2CH1_CH40_LENGTH                                 0x1
#define _AD2CH1_CH40_MASK                                   0x4
// alias bitfield definitions
typedef union {
    struct {
        unsigned CH28                   :1;
        unsigned CH29                   :1;
        unsigned CH40                   :1;
    };
} AAD2CH1bits_t;
extern volatile AAD2CH1bits_t AAD2CH1bits __at(0x79F);
// bitfield macros
#define _AAD2CH1_CH28_POSN                                  0x0
#define _AAD2CH1_CH28_POSITION                              0x0
#define _AAD2CH1_CH28_SIZE                                  0x1
#define _AAD2CH1_CH28_LENGTH                                0x1
#define _AAD2CH1_CH28_MASK                                  0x1
#define _AAD2CH1_CH29_POSN                                  0x1
#define _AAD2CH1_CH29_POSITION                              0x1
#define _AAD2CH1_CH29_SIZE                                  0x1
#define _AAD2CH1_CH29_LENGTH                                0x1
#define _AAD2CH1_CH29_MASK                                  0x2
#define _AAD2CH1_CH40_POSN                                  0x2
#define _AAD2CH1_CH40_POSITION                              0x2
#define _AAD2CH1_CH40_SIZE                                  0x1
#define _AAD2CH1_CH40_LENGTH                                0x1
#define _AAD2CH1_CH40_MASK                                  0x4

// Register: ICDIO
#define ICDIO ICDIO
extern volatile unsigned char           ICDIO               __at(0xF8C);
#ifndef _LIB_BUILD
asm("ICDIO equ 0F8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned TRIS_ICDCLK            :1;
        unsigned TRIS_ICDDAT            :1;
        unsigned LAT_ICDCLK             :1;
        unsigned LAT_ICDDAT             :1;
        unsigned PORT_ICDCLK            :1;
        unsigned PORT_ICDDAT            :1;
    };
} ICDIObits_t;
extern volatile ICDIObits_t ICDIObits __at(0xF8C);
// bitfield macros
#define _ICDIO_TRIS_ICDCLK_POSN                             0x2
#define _ICDIO_TRIS_ICDCLK_POSITION                         0x2
#define _ICDIO_TRIS_ICDCLK_SIZE                             0x1
#define _ICDIO_TRIS_ICDCLK_LENGTH                           0x1
#define _ICDIO_TRIS_ICDCLK_MASK                             0x4
#define _ICDIO_TRIS_ICDDAT_POSN                             0x3
#define _ICDIO_TRIS_ICDDAT_POSITION                         0x3
#define _ICDIO_TRIS_ICDDAT_SIZE                             0x1
#define _ICDIO_TRIS_ICDDAT_LENGTH                           0x1
#define _ICDIO_TRIS_ICDDAT_MASK                             0x8
#define _ICDIO_LAT_ICDCLK_POSN                              0x4
#define _ICDIO_LAT_ICDCLK_POSITION                          0x4
#define _ICDIO_LAT_ICDCLK_SIZE                              0x1
#define _ICDIO_LAT_ICDCLK_LENGTH                            0x1
#define _ICDIO_LAT_ICDCLK_MASK                              0x10
#define _ICDIO_LAT_ICDDAT_POSN                              0x5
#define _ICDIO_LAT_ICDDAT_POSITION                          0x5
#define _ICDIO_LAT_ICDDAT_SIZE                              0x1
#define _ICDIO_LAT_ICDDAT_LENGTH                            0x1
#define _ICDIO_LAT_ICDDAT_MASK                              0x20
#define _ICDIO_PORT_ICDCLK_POSN                             0x6
#define _ICDIO_PORT_ICDCLK_POSITION                         0x6
#define _ICDIO_PORT_ICDCLK_SIZE                             0x1
#define _ICDIO_PORT_ICDCLK_LENGTH                           0x1
#define _ICDIO_PORT_ICDCLK_MASK                             0x40
#define _ICDIO_PORT_ICDDAT_POSN                             0x7
#define _ICDIO_PORT_ICDDAT_POSITION                         0x7
#define _ICDIO_PORT_ICDDAT_SIZE                             0x1
#define _ICDIO_PORT_ICDDAT_LENGTH                           0x1
#define _ICDIO_PORT_ICDDAT_MASK                             0x80

// Register: ICDCON0
#define ICDCON0 ICDCON0
extern volatile unsigned char           ICDCON0             __at(0xF8D);
#ifndef _LIB_BUILD
asm("ICDCON0 equ 0F8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSTVEC                 :1;
        unsigned                        :2;
        unsigned DBGINEX                :1;
        unsigned                        :1;
        unsigned SSTEP                  :1;
        unsigned FREEZ                  :1;
        unsigned INBUG                  :1;
    };
} ICDCON0bits_t;
extern volatile ICDCON0bits_t ICDCON0bits __at(0xF8D);
// bitfield macros
#define _ICDCON0_RSTVEC_POSN                                0x0
#define _ICDCON0_RSTVEC_POSITION                            0x0
#define _ICDCON0_RSTVEC_SIZE                                0x1
#define _ICDCON0_RSTVEC_LENGTH                              0x1
#define _ICDCON0_RSTVEC_MASK                                0x1
#define _ICDCON0_DBGINEX_POSN                               0x3
#define _ICDCON0_DBGINEX_POSITION                           0x3
#define _ICDCON0_DBGINEX_SIZE                               0x1
#define _ICDCON0_DBGINEX_LENGTH                             0x1
#define _ICDCON0_DBGINEX_MASK                               0x8
#define _ICDCON0_SSTEP_POSN                                 0x5
#define _ICDCON0_SSTEP_POSITION                             0x5
#define _ICDCON0_SSTEP_SIZE                                 0x1
#define _ICDCON0_SSTEP_LENGTH                               0x1
#define _ICDCON0_SSTEP_MASK                                 0x20
#define _ICDCON0_FREEZ_POSN                                 0x6
#define _ICDCON0_FREEZ_POSITION                             0x6
#define _ICDCON0_FREEZ_SIZE                                 0x1
#define _ICDCON0_FREEZ_LENGTH                               0x1
#define _ICDCON0_FREEZ_MASK                                 0x40
#define _ICDCON0_INBUG_POSN                                 0x7
#define _ICDCON0_INBUG_POSITION                             0x7
#define _ICDCON0_INBUG_SIZE                                 0x1
#define _ICDCON0_INBUG_LENGTH                               0x1
#define _ICDCON0_INBUG_MASK                                 0x80

// Register: ICDSTAT
#define ICDSTAT ICDSTAT
extern volatile unsigned char           ICDSTAT             __at(0xF91);
#ifndef _LIB_BUILD
asm("ICDSTAT equ 0F91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned USRHLTF                :1;
        unsigned                        :4;
        unsigned TRP0HLTF               :1;
        unsigned TRP1HLTF               :1;
    };
} ICDSTATbits_t;
extern volatile ICDSTATbits_t ICDSTATbits __at(0xF91);
// bitfield macros
#define _ICDSTAT_USRHLTF_POSN                               0x1
#define _ICDSTAT_USRHLTF_POSITION                           0x1
#define _ICDSTAT_USRHLTF_SIZE                               0x1
#define _ICDSTAT_USRHLTF_LENGTH                             0x1
#define _ICDSTAT_USRHLTF_MASK                               0x2
#define _ICDSTAT_TRP0HLTF_POSN                              0x6
#define _ICDSTAT_TRP0HLTF_POSITION                          0x6
#define _ICDSTAT_TRP0HLTF_SIZE                              0x1
#define _ICDSTAT_TRP0HLTF_LENGTH                            0x1
#define _ICDSTAT_TRP0HLTF_MASK                              0x40
#define _ICDSTAT_TRP1HLTF_POSN                              0x7
#define _ICDSTAT_TRP1HLTF_POSITION                          0x7
#define _ICDSTAT_TRP1HLTF_SIZE                              0x1
#define _ICDSTAT_TRP1HLTF_LENGTH                            0x1
#define _ICDSTAT_TRP1HLTF_MASK                              0x80

