MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1566/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCTX<A1TX0>
extern volatile __bit                   A1TX0               __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 A1TX0_bit           _BIT_ACCESS(ADCTX,0)
// ADCTX<A1TX1>
extern volatile __bit                   A1TX1               __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 A1TX1_bit           _BIT_ACCESS(ADCTX,1)
// ADCTX<A1TX2>
extern volatile __bit                   A1TX2               __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 A1TX2_bit           _BIT_ACCESS(ADCTX,2)
// ADCTX<A2TX0>
extern volatile __bit                   A2TX0               __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 A2TX0_bit           _BIT_ACCESS(ADCTX,4)
// ADCTX<A2TX1>
extern volatile __bit                   A2TX1               __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 A2TX1_bit           _BIT_ACCESS(ADCTX,5)
// ADCTX<A2TX2>
extern volatile __bit                   A2TX2               __at(0x348E);	// @ (0x691 * 8 + 6)
#define                                 A2TX2_bit           _BIT_ACCESS(ADCTX,6)
// BAUDCON<ABDEN>
extern volatile __bit                   ABDEN               __at(0xCF8);	// @ (0x19F * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUDCON,0)
// BAUDCON<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0xCFF);	// @ (0x19F * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUDCON,7)
// ADSTAT<AD1CONV>
extern volatile __bit                   AD1CONV             __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 AD1CONV_bit         _BIT_ACCESS(ADSTAT,2)
// AD1CON3<AD1DSEN>
extern volatile __bit                   AD1DSEN             __at(0x38A0);	// @ (0x714 * 8 + 0)
#define                                 AD1DSEN_bit         _BIT_ACCESS(AD1CON3,0)
// AD1CON3<AD1EPPOL>
extern volatile __bit                   AD1EPPOL            __at(0x38A7);	// @ (0x714 * 8 + 7)
#define                                 AD1EPPOL_bit        _BIT_ACCESS(AD1CON3,7)
// PIE1<AD1IE>
extern volatile __bit                   AD1IE               __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 AD1IE_bit           _BIT_ACCESS(PIE1,6)
// PIR1<AD1IF>
extern volatile __bit                   AD1IF               __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 AD1IF_bit           _BIT_ACCESS(PIR1,6)
// AD1CON3<AD1IPEN>
extern volatile __bit                   AD1IPEN             __at(0x38A1);	// @ (0x714 * 8 + 1)
#define                                 AD1IPEN_bit         _BIT_ACCESS(AD1CON3,1)
// AD1CON3<AD1IPPOL>
extern volatile __bit                   AD1IPPOL            __at(0x38A6);	// @ (0x714 * 8 + 6)
#define                                 AD1IPPOL_bit        _BIT_ACCESS(AD1CON3,6)
// ADSTAT<AD1STG0>
extern volatile __bit                   AD1STG0             __at(0x38A8);	// @ (0x715 * 8 + 0)
#define                                 AD1STG0_bit         _BIT_ACCESS(ADSTAT,0)
// ADSTAT<AD1STG1>
extern volatile __bit                   AD1STG1             __at(0x38A9);	// @ (0x715 * 8 + 1)
#define                                 AD1STG1_bit         _BIT_ACCESS(ADSTAT,1)
// ADSTAT<AD2CONV>
extern volatile __bit                   AD2CONV             __at(0x38AE);	// @ (0x715 * 8 + 6)
#define                                 AD2CONV_bit         _BIT_ACCESS(ADSTAT,6)
// AD2CON3<AD2DSEN>
extern volatile __bit                   AD2DSEN             __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 AD2DSEN_bit         _BIT_ACCESS(AD2CON3,0)
// AD2CON3<AD2EPPOL>
extern volatile __bit                   AD2EPPOL            __at(0x3CA7);	// @ (0x794 * 8 + 7)
#define                                 AD2EPPOL_bit        _BIT_ACCESS(AD2CON3,7)
// PIE2<AD2IE>
extern volatile __bit                   AD2IE               __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 AD2IE_bit           _BIT_ACCESS(PIE2,6)
// PIR2<AD2IF>
extern volatile __bit                   AD2IF               __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 AD2IF_bit           _BIT_ACCESS(PIR2,6)
// AD2CON3<AD2IPEN>
extern volatile __bit                   AD2IPEN             __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 AD2IPEN_bit         _BIT_ACCESS(AD2CON3,1)
// AD2CON3<AD2IPPOL>
extern volatile __bit                   AD2IPPOL            __at(0x3CA6);	// @ (0x794 * 8 + 6)
#define                                 AD2IPPOL_bit        _BIT_ACCESS(AD2CON3,6)
// AD2CON0<AD2ON>
extern volatile __bit                   AD2ON               __at(0x3C88);	// @ (0x791 * 8 + 0)
#define                                 AD2ON_bit           _BIT_ACCESS(AD2CON0,0)
// ADSTAT<AD2STG0>
extern volatile __bit                   AD2STG0             __at(0x38AC);	// @ (0x715 * 8 + 4)
#define                                 AD2STG0_bit         _BIT_ACCESS(ADSTAT,4)
// ADSTAT<AD2STG1>
extern volatile __bit                   AD2STG1             __at(0x38AD);	// @ (0x715 * 8 + 5)
#define                                 AD2STG1_bit         _BIT_ACCESS(ADSTAT,5)
// ADSTAT<ADCONV>
extern volatile __bit                   ADCONV              __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 ADCONV_bit          _BIT_ACCESS(ADSTAT,2)
// ADCOMCON<ADCS0>
extern volatile __bit                   ADCS0               __at(0x3894);	// @ (0x712 * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCOMCON,4)
// ADCOMCON<ADCS1>
extern volatile __bit                   ADCS1               __at(0x3895);	// @ (0x712 * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCOMCON,5)
// ADCOMCON<ADCS2>
extern volatile __bit                   ADCS2               __at(0x3896);	// @ (0x712 * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCOMCON,6)
// RCSTA<ADDEN>
extern volatile __bit                   ADDEN               __at(0xCEB);	// @ (0x19D * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA,3)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADGO_bit            _BIT_ACCESS(ADCON0,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA3>
extern volatile __bit                   ANSA3               __at(0xC63);	// @ (0x18C * 8 + 3)
#define                                 ANSA3_bit           _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSA5>
extern volatile __bit                   ANSA5               __at(0xC65);	// @ (0x18C * 8 + 5)
#define                                 ANSA5_bit           _BIT_ACCESS(ANSELA,5)
// ANSELA<ANSA6>
extern volatile __bit                   ANSA6               __at(0xC66);	// @ (0x18C * 8 + 6)
#define                                 ANSA6_bit           _BIT_ACCESS(ANSELA,6)
// ANSELA<ANSA7>
extern volatile __bit                   ANSA7               __at(0xC67);	// @ (0x18C * 8 + 7)
#define                                 ANSA7_bit           _BIT_ACCESS(ANSELA,7)
// ANSELB<ANSB0>
extern volatile __bit                   ANSB0               __at(0xC68);	// @ (0x18D * 8 + 0)
#define                                 ANSB0_bit           _BIT_ACCESS(ANSELB,0)
// ANSELB<ANSB1>
extern volatile __bit                   ANSB1               __at(0xC69);	// @ (0x18D * 8 + 1)
#define                                 ANSB1_bit           _BIT_ACCESS(ANSELB,1)
// ANSELB<ANSB2>
extern volatile __bit                   ANSB2               __at(0xC6A);	// @ (0x18D * 8 + 2)
#define                                 ANSB2_bit           _BIT_ACCESS(ANSELB,2)
// ANSELB<ANSB3>
extern volatile __bit                   ANSB3               __at(0xC6B);	// @ (0x18D * 8 + 3)
#define                                 ANSB3_bit           _BIT_ACCESS(ANSELB,3)
// ANSELB<ANSB4>
extern volatile __bit                   ANSB4               __at(0xC6C);	// @ (0x18D * 8 + 4)
#define                                 ANSB4_bit           _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSB5>
extern volatile __bit                   ANSB5               __at(0xC6D);	// @ (0x18D * 8 + 5)
#define                                 ANSB5_bit           _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSB6>
extern volatile __bit                   ANSB6               __at(0xC6E);	// @ (0x18D * 8 + 6)
#define                                 ANSB6_bit           _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSB7>
extern volatile __bit                   ANSB7               __at(0xC6F);	// @ (0x18D * 8 + 7)
#define                                 ANSB7_bit           _BIT_ACCESS(ANSELB,7)
// ANSELC<ANSC0>
extern volatile __bit                   ANSC0               __at(0xC70);	// @ (0x18E * 8 + 0)
#define                                 ANSC0_bit           _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSC1>
extern volatile __bit                   ANSC1               __at(0xC71);	// @ (0x18E * 8 + 1)
#define                                 ANSC1_bit           _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSC2>
extern volatile __bit                   ANSC2               __at(0xC72);	// @ (0x18E * 8 + 2)
#define                                 ANSC2_bit           _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSC3>
extern volatile __bit                   ANSC3               __at(0xC73);	// @ (0x18E * 8 + 3)
#define                                 ANSC3_bit           _BIT_ACCESS(ANSELC,3)
// ANSELC<ANSC4>
extern volatile __bit                   ANSC4               __at(0xC74);	// @ (0x18E * 8 + 4)
#define                                 ANSC4_bit           _BIT_ACCESS(ANSELC,4)
// ANSELC<ANSC5>
extern volatile __bit                   ANSC5               __at(0xC75);	// @ (0x18E * 8 + 5)
#define                                 ANSC5_bit           _BIT_ACCESS(ANSELC,5)
// ANSELC<ANSC6>
extern volatile __bit                   ANSC6               __at(0xC76);	// @ (0x18E * 8 + 6)
#define                                 ANSC6_bit           _BIT_ACCESS(ANSELC,6)
// ANSELC<ANSC7>
extern volatile __bit                   ANSC7               __at(0xC77);	// @ (0x18E * 8 + 7)
#define                                 ANSC7_bit           _BIT_ACCESS(ANSELC,7)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// PIE2<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE2,2)
// PIR2<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR2,2)
// ICDBK0L<BKA0>
extern volatile __bit                   BKA0                __at(0x7CE8);	// @ (0xF9D * 8 + 0)
#define                                 BKA0_bit            _BIT_ACCESS(ICDBK0L,0)
// ICDBK0L<BKA1>
extern volatile __bit                   BKA1                __at(0x7CE9);	// @ (0xF9D * 8 + 1)
#define                                 BKA1_bit            _BIT_ACCESS(ICDBK0L,1)
// ICDBK0H<BKA10>
extern volatile __bit                   BKA10               __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 BKA10_bit           _BIT_ACCESS(ICDBK0H,2)
// ICDBK0H<BKA11>
extern volatile __bit                   BKA11               __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 BKA11_bit           _BIT_ACCESS(ICDBK0H,3)
// ICDBK0H<BKA12>
extern volatile __bit                   BKA12               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 BKA12_bit           _BIT_ACCESS(ICDBK0H,4)
// ICDBK0H<BKA13>
extern volatile __bit                   BKA13               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 BKA13_bit           _BIT_ACCESS(ICDBK0H,5)
// ICDBK0H<BKA14>
extern volatile __bit                   BKA14               __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 BKA14_bit           _BIT_ACCESS(ICDBK0H,6)
// ICDBK0L<BKA2>
extern volatile __bit                   BKA2                __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 BKA2_bit            _BIT_ACCESS(ICDBK0L,2)
// ICDBK0L<BKA3>
extern volatile __bit                   BKA3                __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 BKA3_bit            _BIT_ACCESS(ICDBK0L,3)
// ICDBK0L<BKA4>
extern volatile __bit                   BKA4                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 BKA4_bit            _BIT_ACCESS(ICDBK0L,4)
// ICDBK0L<BKA5>
extern volatile __bit                   BKA5                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 BKA5_bit            _BIT_ACCESS(ICDBK0L,5)
// ICDBK0L<BKA6>
extern volatile __bit                   BKA6                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 BKA6_bit            _BIT_ACCESS(ICDBK0L,6)
// ICDBK0L<BKA7>
extern volatile __bit                   BKA7                __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 BKA7_bit            _BIT_ACCESS(ICDBK0L,7)
// ICDBK0H<BKA8>
extern volatile __bit                   BKA8                __at(0x7CF0);	// @ (0xF9E * 8 + 0)
#define                                 BKA8_bit            _BIT_ACCESS(ICDBK0H,0)
// ICDBK0H<BKA9>
extern volatile __bit                   BKA9                __at(0x7CF1);	// @ (0xF9E * 8 + 1)
#define                                 BKA9_bit            _BIT_ACCESS(ICDBK0H,1)
// ICDBK0CON<BKEN>
extern volatile __bit                   BKEN                __at(0x7CE7);	// @ (0xF9C * 8 + 7)
#define                                 BKEN_bit            _BIT_ACCESS(ICDBK0CON,7)
// ICDBK0CON<BKHLT>
extern volatile __bit                   BKHLT               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 BKHLT_bit           _BIT_ACCESS(ICDBK0CON,0)
// BORCON<BORFS>
extern volatile __bit                   BORFS               __at(0x8B6);	// @ (0x116 * 8 + 6)
#define                                 BORFS_bit           _BIT_ACCESS(BORCON,6)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BAUDCON<BRG16>
extern volatile __bit                   BRG16               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUDCON,3)
// TXSTA<BRGH>
extern volatile __bit                   BRGH                __at(0xCF2);	// @ (0x19E * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA,2)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// AD1CH0<CH10>
extern volatile __bit                   CH10                __at(0x38F0);	// @ (0x71E * 8 + 0)
#define                                 CH10_bit            _BIT_ACCESS(AD1CH0,0)
// AD1CH0<CH11>
extern volatile __bit                   CH11                __at(0x38F1);	// @ (0x71E * 8 + 1)
#define                                 CH11_bit            _BIT_ACCESS(AD1CH0,1)
// AD1CH0<CH12>
extern volatile __bit                   CH12                __at(0x38F2);	// @ (0x71E * 8 + 2)
#define                                 CH12_bit            _BIT_ACCESS(AD1CH0,2)
// AD1CH0<CH13>
extern volatile __bit                   CH13                __at(0x38F3);	// @ (0x71E * 8 + 3)
#define                                 CH13_bit            _BIT_ACCESS(AD1CH0,3)
// AD1CH0<CH14>
extern volatile __bit                   CH14                __at(0x38F4);	// @ (0x71E * 8 + 4)
#define                                 CH14_bit            _BIT_ACCESS(AD1CH0,4)
// AD1CH0<CH15>
extern volatile __bit                   CH15                __at(0x38F5);	// @ (0x71E * 8 + 5)
#define                                 CH15_bit            _BIT_ACCESS(AD1CH0,5)
// AD1CH0<CH16>
extern volatile __bit                   CH16                __at(0x38F6);	// @ (0x71E * 8 + 6)
#define                                 CH16_bit            _BIT_ACCESS(AD1CH0,6)
// AD1CH0<CH17>
extern volatile __bit                   CH17                __at(0x38F7);	// @ (0x71E * 8 + 7)
#define                                 CH17_bit            _BIT_ACCESS(AD1CH0,7)
// AD1CH1<CH18>
extern volatile __bit                   CH18                __at(0x38F8);	// @ (0x71F * 8 + 0)
#define                                 CH18_bit            _BIT_ACCESS(AD1CH1,0)
// AD1CH1<CH19>
extern volatile __bit                   CH19                __at(0x38F9);	// @ (0x71F * 8 + 1)
#define                                 CH19_bit            _BIT_ACCESS(AD1CH1,1)
// AD2CH0<CH20>
extern volatile __bit                   CH20                __at(0x3CF0);	// @ (0x79E * 8 + 0)
#define                                 CH20_bit            _BIT_ACCESS(AD2CH0,0)
// AD2CH0<CH21>
extern volatile __bit                   CH21                __at(0x3CF1);	// @ (0x79E * 8 + 1)
#define                                 CH21_bit            _BIT_ACCESS(AD2CH0,1)
// AD2CH0<CH22>
extern volatile __bit                   CH22                __at(0x3CF2);	// @ (0x79E * 8 + 2)
#define                                 CH22_bit            _BIT_ACCESS(AD2CH0,2)
// AD2CH0<CH23>
extern volatile __bit                   CH23                __at(0x3CF3);	// @ (0x79E * 8 + 3)
#define                                 CH23_bit            _BIT_ACCESS(AD2CH0,3)
// AD2CH0<CH24>
extern volatile __bit                   CH24                __at(0x3CF4);	// @ (0x79E * 8 + 4)
#define                                 CH24_bit            _BIT_ACCESS(AD2CH0,4)
// AD2CH0<CH25>
extern volatile __bit                   CH25                __at(0x3CF5);	// @ (0x79E * 8 + 5)
#define                                 CH25_bit            _BIT_ACCESS(AD2CH0,5)
// AD2CH0<CH26>
extern volatile __bit                   CH26                __at(0x3CF6);	// @ (0x79E * 8 + 6)
#define                                 CH26_bit            _BIT_ACCESS(AD2CH0,6)
// AD2CH0<CH27>
extern volatile __bit                   CH27                __at(0x3CF7);	// @ (0x79E * 8 + 7)
#define                                 CH27_bit            _BIT_ACCESS(AD2CH0,7)
// AD2CH1<CH28>
extern volatile __bit                   CH28                __at(0x3CF8);	// @ (0x79F * 8 + 0)
#define                                 CH28_bit            _BIT_ACCESS(AD2CH1,0)
// AD2CH1<CH29>
extern volatile __bit                   CH29                __at(0x3CF9);	// @ (0x79F * 8 + 1)
#define                                 CH29_bit            _BIT_ACCESS(AD2CH1,1)
// AD2CH1<CH40>
extern volatile __bit                   CH40                __at(0x3CFA);	// @ (0x79F * 8 + 2)
#define                                 CH40_bit            _BIT_ACCESS(AD2CH1,2)
// AD1CH0<CHS17>
extern volatile __bit                   CHS17               __at(0x38F7);	// @ (0x71E * 8 + 7)
#define                                 CHS17_bit           _BIT_ACCESS(AD1CH0,7)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// ICDINSTL<DBGIN0>
extern volatile __bit                   DBGIN0              __at(0x7CB0);	// @ (0xF96 * 8 + 0)
#define                                 DBGIN0_bit          _BIT_ACCESS(ICDINSTL,0)
// ICDINSTL<DBGIN1>
extern volatile __bit                   DBGIN1              __at(0x7CB1);	// @ (0xF96 * 8 + 1)
#define                                 DBGIN1_bit          _BIT_ACCESS(ICDINSTL,1)
// ICDINSTH<DBGIN10>
extern volatile __bit                   DBGIN10             __at(0x7CBA);	// @ (0xF97 * 8 + 2)
#define                                 DBGIN10_bit         _BIT_ACCESS(ICDINSTH,2)
// ICDINSTH<DBGIN11>
extern volatile __bit                   DBGIN11             __at(0x7CBB);	// @ (0xF97 * 8 + 3)
#define                                 DBGIN11_bit         _BIT_ACCESS(ICDINSTH,3)
// ICDINSTH<DBGIN12>
extern volatile __bit                   DBGIN12             __at(0x7CBC);	// @ (0xF97 * 8 + 4)
